//
//  DestinyNumberArkans.swift
//  DestinyMatrix
//
//  Created by Иван Семикин on 02/12/2024.
//

import Foundation

struct DestinyNumberArkans {
    static let allArkans: ArkanDictionary = [
        // MARK: - 1 Arkan
        1: ArkanInfo(
            arkanNumber: 1,
            title: "1. Число Судьбы (1 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Значение числа судьбы",
                    shortDescription: "Общее описание и характеристика полученного числа судьбы:",
                    mainDescription: """
                    Ваше число Судьбы - 1 Аркан. Число 1 символизирует начало, лидерство и индивидуальность. Люди с числом судьбы 1 обладают сильной волей, стремлением к независимости и желанием быть первыми во всем. Они часто становятся пионерами в своих областях, инициируют новые проекты и не боятся брать на себя ответственность.
                    
                    Их энергия направлена на достижение целей и преодоление препятствий. Они уверены в себе, решительны и обладают природным талантом к руководству. Такие люди обычно не боятся рисковать и готовы принимать смелые решения, чтобы добиться успеха.
                    
                    Однако, стремление быть лидером может привести к изоляции, если не уделять внимание сотрудничеству и мнению других людей. Баланс между самостоятельностью и командной работой важен для гармоничного развития личности.
                    """
                ),
                Subcategory(
                    title: "Влияние на личность",
                    shortDescription: "Как число судьбы формирует ваши черты характера и поведение:",
                    mainDescription: """
                    Люди с числом судьбы 1 часто проявляют такие качества, как уверенность, решительность и целеустремленность. Они склонны к самостоятельности и предпочитают действовать независимо. Их природный оптимизм и вера в себя помогают им преодолевать трудности.
                    
                    Они могут быть новаторами и генераторами идей, вдохновляющими окружающих. Однако их стремление к лидерству может перерасти в упрямство или эгоизм, если они не научатся прислушиваться к другим.
                    
                    Для них важно развивать эмпатию и умение работать в команде, чтобы избежать конфликтов и достичь большего успеха.
                    """
                ),
                Subcategory(
                    title: "Рекомендации",
                    shortDescription: "Советы по гармонизации жизни в соответствии с вашим числом судьбы:",
                    mainDescription: """
                    - Развивайте навыки слушания: Учитесь учитывать мнение окружающих.
                    - Практикуйте терпение: Дайте другим время адаптироваться к вашим идеям.
                    - Избегайте излишнего эгоизма: Помните о важности командной работы.
                    - Уделяйте внимание отношениям: Стройте доверительные связи с близкими.
                    - Заботьтесь о здоровье: Не переутомляйтесь в погоне за успехом.
                    
                    Следуя этим советам, вы сможете достичь гармонии в личной и профессиональной сферах.
                    """
                )
            ]
        ),
        // MARK: - 2 Arkan
        2: ArkanInfo(
            arkanNumber: 2,
            title: "1. Число Судьбы (2 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Значение числа судьбы",
                    shortDescription: "Общее описание и характеристика полученного числа судьбы:",
                    mainDescription: """
                    Ваше число Судьбы - 2 Аркан. Число 2 символизирует гармонию, баланс и сотрудничество. Люди с этим числом судьбы обладают природной дипломатичностью и интуицией, что делает их прекрасными посредниками в разрешении конфликтов. Они стремятся создавать комфорт и стабильность вокруг себя, что привлекает к ним других людей.

                    Такие люди часто выступают в роли надежного партнера или советчика, поскольку они умеют слушать и учитывать потребности окружающих. Их чуткость помогает им разбираться в сложных ситуациях и находить компромиссы, которые устраивают всех.

                    Однако их стремление избегать конфликтов может привести к подавлению собственных желаний и потребностей. Им важно развивать уверенность в себе и учиться говорить "нет", чтобы сохранить личные границы и гармонию внутри себя.
                    """
                ),
                Subcategory(
                    title: "Влияние на личность",
                    shortDescription: "Как число судьбы формирует ваши черты характера и поведение:",
                    mainDescription: """
                    Люди с числом судьбы 2 отличаются мягкостью, чуткостью и эмпатией. Они умеют чувствовать настроение других и подстраиваться под обстоятельства. Их эмоциональная отзывчивость делает их ценными друзьями и партнерами.

                    Однако чрезмерная чувствительность может привести к стрессу и неуверенности в своих силах. Иногда они слишком сильно зависят от одобрения окружающих и боятся разочаровать других.

                    Развивая самооценку и умение выражать свои мысли, они могут создать прочный фундамент для достижения своих целей и улучшения отношений.
                    """
                ),
                Subcategory(
                    title: "Рекомендации",
                    shortDescription: "Советы по гармонизации жизни в соответствии с вашим числом судьбы:",
                    mainDescription: """
                    - Учитесь выражать свои желания: Не бойтесь быть услышанным.
                    - Заботьтесь о своих границах: Помните, что ваше мнение важно.
                    - Развивайте уверенность в себе: Укрепляйте самооценку через достижение личных целей.
                    - Ставьте личные приоритеты: Уделяйте время тому, что приносит радость.
                    - Практикуйте методы релаксации: Поддерживайте эмоциональное здоровье.

                    Эти советы помогут вам обрести баланс между заботой о себе и отношениями с окружающими.
                    """
                )
            ]
        ),
        // MARK: - 3 Arkan
        3: ArkanInfo(
            arkanNumber: 3,
            title: "1. Число Судьбы (3 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Значение числа судьбы",
                    shortDescription: "Общее описание и характеристика полученного числа судьбы:",
                    mainDescription: """
                    Ваше число Судьбы - 3 Аркан. Число 3 символизирует творчество, радость и общительность. Люди с этим числом судьбы обладают яркой индивидуальностью, стремлением к самовыражению и природным оптимизмом. Их энтузиазм заряжает окружающих, что делает их вдохновляющими лидерами и партнерами.

                    Они часто талантливы в искусстве, литературе или других творческих сферах. Их умение находить радость в жизни помогает преодолевать трудности и вдохновлять окружающих на новые свершения. Они легко адаптируются к изменениям и быстро учатся новому.

                    Однако склонность к поверхностному отношению и избеганию рутинных задач может препятствовать достижению долгосрочных целей. Для них важно развивать дисциплину и учиться фокусироваться на значимых проектах.
                    """
                ),
                Subcategory(
                    title: "Влияние на личность",
                    shortDescription: "Как число судьбы формирует ваши черты характера и поведение:",
                    mainDescription: """
                    Люди с числом судьбы 3 отличаются оптимизмом, легкостью в общении и творческим подходом к жизни. Они любят быть в центре внимания, их чувство юмора и харизма привлекают к ним окружающих. Они обладают способностью вдохновлять других и поднимать настроение.

                    Однако иногда их излишняя жизнерадостность может выглядеть как несерьезность. Они могут уклоняться от ответственности и бояться обязательств, предпочитая свободу действий.

                    Развивая чувство ответственности и умение планировать, они могут достичь большего успеха как в личной, так и профессиональной жизни.
                    """
                ),
                Subcategory(
                    title: "Рекомендации",
                    shortDescription: "Советы по гармонизации жизни в соответствии с вашим числом судьбы:",
                    mainDescription: """
                    - Развивайте самодисциплину: Учитесь доводить начатое до конца.
                    - Найдите баланс между работой и отдыхом: Не забывайте о долгосрочных целях.
                    - Углубляйте знания: Расширяйте навыки в интересующих вас областях.
                    - Управляйте временем: Составляйте четкий план на день.
                    - Заботьтесь о своей энергии: Избегайте переутомления и эмоционального выгорания.

                    Эти рекомендации помогут вам реализовать ваш потенциал и достичь гармонии в жизни.
                    """
                )
            ]
        ),
        // MARK: - 4 Arkan
        4: ArkanInfo(
            arkanNumber: 4,
            title: "1. Число Судьбы (4 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Значение числа судьбы",
                    shortDescription: "Общее описание и характеристика полученного числа судьбы:",
                    mainDescription: """
                    Ваше число Судьбы - 4 Аркан. Число 4 символизирует стабильность, дисциплину и упорство. Люди с этим числом судьбы обладают сильным чувством ответственности, трудолюбием и способностью к планированию. Они стремятся создавать надежную основу для своей жизни, уделяя внимание деталям и последовательности в действиях.

                    Такие люди отлично подходят для работы, требующей терпения и сосредоточенности. Их прагматизм позволяет им принимать взвешенные решения, которые обеспечивают устойчивость в долгосрочной перспективе. Они предпочитают организованный подход и избегают лишних рисков.

                    Однако склонность к излишней строгости и консервативности может ограничивать их возможности. Им важно учиться принимать изменения и оставаться открытыми для новых идей, чтобы не упустить перспективы роста и развития.
                    """
                ),
                Subcategory(
                    title: "Влияние на личность",
                    shortDescription: "Как число судьбы формирует ваши черты характера и поведение:",
                    mainDescription: """
                    Люди с числом судьбы 4 проявляют решительность, настойчивость и преданность своим целям. Они любят порядок, ценят стабильность и всегда стремятся выполнять свои обязанности на высшем уровне. Их надежность делает их важными членами любого коллектива или семьи.

                    Однако их строгость к себе и другим может вызывать трудности в общении. Иногда они могут казаться чересчур критичными или жесткими, что создает напряжение в отношениях. Им полезно развивать гибкость и терпимость, чтобы лучше взаимодействовать с окружающими.

                    В то же время их преданность и усердие делают их успешными в достижении своих целей, если они сохраняют баланс между дисциплиной и открытостью.
                    """
                ),
                Subcategory(
                    title: "Рекомендации",
                    shortDescription: "Советы по гармонизации жизни в соответствии с вашим числом судьбы:",
                    mainDescription: """
                    - Развивайте гибкость: Будьте открыты для новых идей и перспектив.
                    - Балансируйте работу и отдых: Найдите время для расслабления и восстановления энергии.
                    - Практикуйте терпимость: Старайтесь понимать других и не быть слишком строгими.
                    - Учитесь принимать изменения: Примите, что перемены могут быть полезными.
                    - Ставьте долгосрочные цели: Постепенно добивайтесь их с помощью последовательных действий.

                    Эти рекомендации помогут вам сохранять стабильность и гармонию в жизни, не теряя открытости для новых возможностей.
                    """
                )
            ]
        ),
        // MARK: - 5 Arkan
        5: ArkanInfo(
            arkanNumber: 5,
            title: "1. Число Судьбы (5 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Значение числа судьбы",
                    shortDescription: "Общее описание и характеристика полученного числа судьбы:",
                    mainDescription: """
                    Ваше число Судьбы - 5 Аркан. Число 5 символизирует свободу, приключения и перемены. Люди с этим числом судьбы обладают жаждой нового опыта и стремлением к исследованию мира. Они любят динамику и перемены, что помогает им адаптироваться к новым обстоятельствам и находить нестандартные решения.

                    Такие люди обладают острым умом и способны быстро обучаться, что делает их успешными в разнообразных сферах. Они не боятся рисковать и готовы к экспериментам, которые открывают новые горизонты.

                    Однако их склонность к импульсивности может привести к недальновидным решениям. Им важно развивать ответственность и умение планировать, чтобы их жизнь была более стабильной и сбалансированной.
                    """
                ),
                Subcategory(
                    title: "Влияние на личность",
                    shortDescription: "Как число судьбы формирует ваши черты характера и поведение:",
                    mainDescription: """
                    Люди с числом судьбы 5 часто проявляют независимость, открытость к новым возможностям и энергию. Они обожают свободу и не терпят ограничений, стремясь к самовыражению и независимости в своих действиях. Их жизнерадостность вдохновляет окружающих и помогает находить общий язык в любой ситуации.

                    Однако их неспособность к рутине и склонность к спонтанности могут мешать им достигать долгосрочных целей. Иногда они могут избегать обязательств, предпочитая легкость и гибкость.

                    Для достижения успеха им важно учиться сочетать свою страсть к приключениям с ответственностью за свои решения и действия.
                    """
                ),
                Subcategory(
                    title: "Рекомендации",
                    shortDescription: "Советы по гармонизации жизни в соответствии с вашим числом судьбы:",
                    mainDescription: """
                    - Развивайте самодисциплину: Учитесь доводить начатое до конца.
                    - Планируйте свой день: Найдите баланс между спонтанностью и структурой.
                    - Избегайте излишней импульсивности: Обдумывайте свои действия перед принятием решений.
                    - Уделяйте внимание отношениям: Старайтесь строить стабильные и надежные связи.
                    - Заботьтесь о здоровье: Регулярно отдыхайте и находите время для восстановления энергии.

                    Следуя этим рекомендациям, вы сможете сохранить свою уникальную свободу и при этом достичь устойчивого успеха в жизни.
                    """
                )
            ]
        ),
        // MARK: - 6 Arkan
        6: ArkanInfo(
            arkanNumber: 6,
            title: "1. Число Судьбы (6 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Значение числа судьбы",
                    shortDescription: "Общее описание и характеристика полученного числа судьбы:",
                    mainDescription: """
                    Ваше число Судьбы - 6 Аркан. Число 6 символизирует любовь, гармонию и ответственность. Люди с этим числом судьбы стремятся к созданию теплой и стабильной атмосферы. Их прирожденная эмпатия и желание заботиться о других делают их незаменимыми членами общества и семьи. Они направляют усилия на укрепление отношений, поддержание мира и создание баланса.

                    Эти люди всегда готовы поддержать близких и взять на себя ответственность за общее благо. Они прекрасно понимают потребности окружающих и прилагают максимум усилий для их удовлетворения. Их умение находить компромиссы и стремление к гармонии выделяют их среди других.

                    Однако излишняя самоотверженность может привести к тому, что они забывают о собственных нуждах. Им важно научиться говорить "нет" и уделять внимание собственному благополучию. Находя баланс между отдачей и принятием, они могут избежать эмоционального выгорания и сохранить гармонию.
                    """
                ),
                Subcategory(
                    title: "Влияние на личность",
                    shortDescription: "Как число судьбы формирует ваши черты характера и поведение:",
                    mainDescription: """
                    Люди с числом судьбы 6 отличаются добротой, чуткостью и ответственностью. Они обладают природной способностью привносить гармонию в любые отношения, будь то дружба, работа или семья. Их щедрость и преданность делают их любимыми и уважаемыми среди окружающих.

                    Однако их стремление к идеалу иногда приводит к разочарованиям, особенно если их усилия остаются незамеченными. Они могут быть склонны к самокритике или ожидать от других слишком многого. Иногда они берут на себя больше обязательств, чем могут выполнить.

                    Развивая умение ценить свои достижения и не зависеть от одобрения окружающих, они могут достичь гармонии и укрепить свои отношения с другими.
                    """
                ),
                Subcategory(
                    title: "Рекомендации",
                    shortDescription: "Советы по гармонизации жизни в соответствии с вашим числом судьбы:",
                    mainDescription: """
                    - Заботьтесь о своих потребностях: Учитесь уделять время личным интересам и отдыху.
                    - Устанавливайте границы: Не бойтесь говорить "нет", чтобы избежать перегрузок.
                    - Находите баланс: Уравновешивайте отдачу с возможностью получать помощь от других.
                    - Развивайте терпимость: Не ожидайте идеала от себя и окружающих.
                    - Практикуйте расслабление: Найдите время для медитации и восстановления энергии.

                    Эти советы помогут вам сохранить внутреннюю гармонию и построить здоровые отношения с окружающими.
                    """
                )
            ]
        ),
        // MARK: - 7 Arkan
        7: ArkanInfo(
            arkanNumber: 7,
            title: "1. Число Судьбы (7 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Значение числа судьбы",
                    shortDescription: "Общее описание и характеристика полученного числа судьбы:",
                    mainDescription: """
                    Ваше число Судьбы - 7 Аркан. Число 7 символизирует глубокое познание, мудрость и внутренний рост. Люди с этим числом судьбы обладают аналитическим умом и склонностью к самоанализу. Они часто задаются вопросами о смысле жизни, стремятся понять законы мироздания и исследовать духовные аспекты бытия.

                    Эти люди ценят уединение и интеллектуальные занятия. Они могут быть увлечены наукой, философией или искусством. Их уникальная способность видеть скрытые связи помогает им находить истину там, где другие видят только хаос. Они обладают развитой интуицией, которая направляет их в трудные моменты.

                    Однако их стремление к уединению иногда отдаляет их от общества, что может привести к чувству одиночества. Им важно учиться находить баланс между личным временем и взаимодействием с другими людьми, чтобы гармонично развиваться и находить поддержку.
                    """
                ),
                Subcategory(
                    title: "Влияние на личность",
                    shortDescription: "Как число судьбы формирует ваши черты характера и поведение:",
                    mainDescription: """
                    Люди с числом судьбы 7 часто проявляют стремление к саморазвитию и глубокому пониманию окружающего мира. Их аналитическое мышление и любовь к знаниям делают их выдающимися исследователями и мыслителями. Они предпочитают действовать обдуманно и принимать решения, основанные на фактах и интуиции.

                    Однако их замкнутость и склонность к изоляции могут вызывать трудности в общении. Иногда они кажутся холодными или отстраненными, что мешает устанавливать крепкие отношения. Им важно научиться делиться своими мыслями и идеями, чтобы наладить взаимопонимание с окружающими.

                    Развивая способность к открытому общению, они могут укрепить свои социальные связи и добиться большего в личной и профессиональной жизни.
                    """
                ),
                Subcategory(
                    title: "Рекомендации",
                    shortDescription: "Советы по гармонизации жизни в соответствии с вашим числом судьбы:",
                    mainDescription: """
                    - Развивайте социальные навыки: Найдите время для общения с друзьями и семьей.
                    - Практикуйте духовные практики: Медитация и самопознание помогут укрепить вашу интуицию.
                    - Делитесь знаниями: Не бойтесь рассказывать о своих идеях другим.
                    - Найдите баланс: Уделяйте внимание как интеллектуальным, так и социальным аспектам жизни.
                    - Заботьтесь о здоровье: Регулярно отдыхайте и занимайтесь физическими упражнениями.

                    Эти рекомендации помогут вам найти внутренний баланс и достичь гармонии во всех аспектах жизни.
                    """
                )
            ]
        ),
        // MARK: - 8 Arkan
        8: ArkanInfo(
            arkanNumber: 8,
            title: "1. Число Судьбы (8 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Значение числа судьбы",
                    shortDescription: "Общее описание и характеристика полученного числа судьбы:",
                    mainDescription: """
                    Ваше число Судьбы - 8 Аркан. Число 8 символизирует силу, справедливость и умение достигать целей. Люди с этим числом судьбы обладают природным лидерством, решительностью и талантом к управлению ресурсами. Они стремятся к успеху и материальному благополучию, но при этом высоко ценят честность и равновесие.

                    Эти люди уверены в себе и способны преодолевать любые препятствия, благодаря своей настойчивости и умению принимать взвешенные решения. Их стремление к совершенству помогает им не только добиваться поставленных целей, но и вдохновлять окружающих.

                    Однако их склонность к стремлению контролировать все вокруг может привести к напряжению в отношениях. Им важно находить баланс между амбициями и заботой о других, чтобы сохранить гармонию и уважение в окружении.
                    """
                ),
                Subcategory(
                    title: "Влияние на личность",
                    shortDescription: "Как число судьбы формирует ваши черты характера и поведение:",
                    mainDescription: """
                    Люди с числом судьбы 8 часто проявляют уверенность, целеустремленность и организаторские способности. Они умеют брать на себя ответственность и эффективно управлять как личными, так и коллективными ресурсами. Их природный дар решать сложные задачи делает их незаменимыми в кризисных ситуациях.

                    Однако их амбициозность и склонность к строгому контролю иногда приводят к излишней напряженности и конфликтам. Они могут требовать от себя и других слишком многого, что создает давление и стресс.

                    Им важно развивать эмпатию и гибкость, чтобы стать более доступными для окружающих и наладить гармоничные отношения. Это поможет им раскрыть свой потенциал в полной мере и укрепить связи с близкими.
                    """
                ),
                Subcategory(
                    title: "Рекомендации",
                    shortDescription: "Советы по гармонизации жизни в соответствии с вашим числом судьбы:",
                    mainDescription: """
                    - Развивайте гибкость: Учитесь принимать мнение других и учитывать их потребности.
                    - Сохраняйте баланс: Находите время для отдыха и личных интересов.
                    - Работайте над эмпатией: Практикуйте внимательное слушание и поддержку окружающих.
                    - Избегайте переутомления: Регулярно отдыхайте, чтобы поддерживать высокую эффективность.
                    - Ставьте долгосрочные цели: Фокусируйтесь на том, что действительно важно.

                    Эти рекомендации помогут вам не только достичь успеха, но и сохранить гармонию в отношениях с окружающими.
                    """
                )
            ]
        ),
        // MARK: - 9 Arkan
        9: ArkanInfo(
            arkanNumber: 9,
            title: "1. Число Судьбы (9 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Значение числа судьбы",
                    shortDescription: "Общее описание и характеристика полученного числа судьбы:",
                    mainDescription: """
                    Ваше число Судьбы - 9 Аркан. Число 9 символизирует мудрость, альтруизм и стремление к высокому. Люди с этим числом судьбы обладают глубоким внутренним миром, богатым воображением и ярко выраженным чувством справедливости. Они ориентированы на помощь другим и часто выбирают путь служения обществу.

                    Эти люди отличаются способностью вдохновлять и поддерживать окружающих, привнося свет и гармонию в их жизнь. Они ищут глубокий смысл во всем, что делают, и готовы жертвовать личным комфортом ради достижения глобальных целей или помощи тем, кто в этом нуждается.

                    Однако их склонность к самопожертвованию иногда приводит к эмоциональному истощению. Им важно находить баланс между служением другим и заботой о собственном благополучии, чтобы оставаться эффективными и счастливым.
                    """
                ),
                Subcategory(
                    title: "Влияние на личность",
                    shortDescription: "Как число судьбы формирует ваши черты характера и поведение:",
                    mainDescription: """
                    Люди с числом судьбы 9 обладают богатым внутренним миром, состраданием и сильным чувством справедливости. Они стремятся сделать мир лучше, вдохновляя других своим примером и привлекая их к решению общих задач. Их способность к глубокому анализу позволяет находить нестандартные решения.

                    Однако иногда они склонны к излишнему идеализму, что приводит к разочарованиям, если реальность не соответствует их ожиданиям. Они могут быть слишком требовательными к себе и окружающим, что создает эмоциональное напряжение.

                    Научившись принимать несовершенства мира и направляя свои усилия на достижение реальных целей, они смогут обрести гармонию и реализовать свой потенциал.
                    """
                ),
                Subcategory(
                    title: "Рекомендации",
                    shortDescription: "Советы по гармонизации жизни в соответствии с вашим числом судьбы:",
                    mainDescription: """
                    - Сохраняйте баланс: Находите время для заботы о себе, чтобы не выгорать.
                    - Реалистично оценивайте ситуации: Ставьте достижимые цели, чтобы избежать разочарований.
                    - Уделяйте внимание отношениям: Работайте над построением доверительных связей.
                    - Находите радость в мелочах: Учитесь ценить настоящее и получать удовольствие от жизни.
                    - Занимайтесь саморазвитием: Исследуйте свои интересы и постоянно учитесь новому.

                    Эти рекомендации помогут вам сохранять внутреннюю гармонию и направлять свою энергию на позитивные изменения.
                    """
                )
            ]
        ),
        // MARK: - 10 Arkan
        10: ArkanInfo(
            arkanNumber: 10,
            title: "1. Число Судьбы (10 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Значение числа судьбы",
                    shortDescription: "Общее описание и характеристика полученного числа судьбы:",
                    mainDescription: """
                    Ваше число Судьбы - 10 Аркан. Число 10 символизирует цикличность, удачу и перемены. Люди с этим числом судьбы обладают уникальной способностью адаптироваться к изменениям и использовать их в свою пользу. Они видят возможности в любых ситуациях и могут превратить даже неудачу в важный урок.

                    Эти люди находятся в постоянном движении, охотно принимая новые вызовы. Они полны энтузиазма, что позволяет им вдохновлять окружающих и быстро находить выход из сложных ситуаций. Их способность доверять судьбе помогает им принимать изменения с легкостью.

                    Однако их склонность к быстрому принятию решений может иногда приводить к ошибкам или непродуманным шагам. Им важно научиться анализировать последствия своих действий и не бояться замедляться, чтобы обрести устойчивость и гармонию в жизни.
                    """
                ),
                Subcategory(
                    title: "Влияние на личность",
                    shortDescription: "Как число судьбы формирует ваши черты характера и поведение:",
                    mainDescription: """
                    Люди с числом судьбы 10 отличаются динамичностью, оптимизмом и склонностью к риску. Они быстро реагируют на изменения, благодаря чему легко адаптируются к новым условиям. Их природное обаяние и харизма помогают им завоевывать симпатии окружающих.

                    Однако их тяга к постоянным изменениям иногда мешает им удерживаться на одном пути. Они могут испытывать трудности с концентрацией и завершением начатых проектов. Склонность к импульсивности также может вызывать сложности в принятии решений.

                    Для гармоничного развития им важно учиться сочетать свою энергию и стремление к переменам с дисциплиной и умением доводить начатое до конца. Это позволит им реализовать свой потенциал и достичь стабильности.
                    """
                ),
                Subcategory(
                    title: "Рекомендации",
                    shortDescription: "Советы по гармонизации жизни в соответствии с вашим числом судьбы:",
                    mainDescription: """
                    - Планируйте свои действия: Составляйте четкие планы, чтобы избежать спонтанных ошибок.
                    - Учитесь замедляться: Найдите время для размышлений и оценки своих шагов.
                    - Балансируйте стабильность и перемены: Не забывайте о долгосрочных целях, даже если вам интересно пробовать новое.
                    - Укрепляйте связи: Работайте над созданием крепких и доверительных отношений.
                    - Заботьтесь о здоровье: Регулярно находите время для отдыха и восстановления энергии.

                    Следуя этим рекомендациям, вы сможете использовать свой потенциал для достижения успеха и гармонии в жизни.
                    """
                )
            ]
        ),
        // MARK: - 11 Arkan
        11: ArkanInfo(
            arkanNumber: 11,
            title: "1. Число Судьбы (11 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Значение числа судьбы",
                    shortDescription: "Общее описание и характеристика полученного числа судьбы:",
                    mainDescription: """
                    Ваше число Судьбы - 11 Аркан. Число 11 символизирует силу, вдохновение и внутренний потенциал. Люди с этим числом судьбы обладают уникальной способностью влиять на окружающих своей энергией и лидерскими качествами. Они естественным образом притягивают к себе людей, которые ищут мотивацию и поддержку.

                    Эти люди часто проявляют стойкость перед лицом трудностей и уверенность в своих силах. Они видят смысл в преодолении испытаний, что делает их примером для окружающих. Их творческая энергия помогает им находить нестандартные решения и вдохновлять других.

                    Однако их внутренняя сила может иногда превращаться в упрямство, если они слишком сосредоточены на своих идеях. Им важно учиться принимать критику и учитывать мнение других, чтобы их лидерство стало более эффективным и гармоничным.
                    """
                ),
                Subcategory(
                    title: "Влияние на личность",
                    shortDescription: "Как число судьбы формирует ваши черты характера и поведение:",
                    mainDescription: """
                    Люди с числом судьбы 11 отличаются высокой энергией, харизмой и способностью вдохновлять других. Они стремятся к развитию и часто ставят перед собой амбициозные цели. Их внутренняя сила помогает им преодолевать трудности и добиваться успеха.

                    Однако их сильный характер иногда может вызывать конфликты, если они не учитывают точку зрения окружающих. Их стремление к независимости может создавать впечатление, что они не нуждаются в поддержке, что иногда отдаляет их от других.

                    Развивая эмпатию и умение сотрудничать, они могут не только укрепить свои связи с окружающими, но и достичь больших высот в личной и профессиональной жизни.
                    """
                ),
                Subcategory(
                    title: "Рекомендации",
                    shortDescription: "Советы по гармонизации жизни в соответствии с вашим числом судьбы:",
                    mainDescription: """
                    - Развивайте эмпатию: Старайтесь учитывать чувства и потребности других.
                    - Укрепляйте командный дух: Учитесь эффективно работать в команде.
                    - Управляйте энергией: Не забывайте о балансе между работой и отдыхом.
                    - Принимайте критику: Используйте её для самосовершенствования и роста.
                    - Заботьтесь о мотивации: Поддерживайте интерес к своим целям через регулярные успехи.

                    Эти советы помогут вам раскрыть ваш потенциал и достичь гармонии во всех аспектах жизни.
                    """
                )
            ]
        ),
        // MARK: - 12 Arkan
        12: ArkanInfo(
            arkanNumber: 12,
            title: "1. Число Судьбы (12 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Значение числа судьбы",
                    shortDescription: "Общее описание и характеристика полученного числа судьбы:",
                    mainDescription: """
                    Ваше число Судьбы - 12 Аркан. Число 12 символизирует смирение, самопожертвование и глубокую внутреннюю трансформацию. Люди с этим числом судьбы обладают способностью видеть мир с разных точек зрения, что помогает им принимать сложные решения и преодолевать трудности.

                    Эти люди склонны жертвовать своим комфортом ради достижения высших целей или помощи другим. Их мудрость и спокойствие позволяют им находить гармонию даже в самых трудных ситуациях. Они часто становятся источником поддержки и вдохновения для окружающих.

                    Однако излишняя склонность к самопожертвованию может привести к потере собственного «я». Им важно научиться устанавливать личные границы, чтобы избежать выгорания и сохранить баланс между отдачей и заботой о себе.
                    """
                ),
                Subcategory(
                    title: "Влияние на личность",
                    shortDescription: "Как число судьбы формирует ваши черты характера и поведение:",
                    mainDescription: """
                    Люди с числом судьбы 12 проявляют терпение, эмпатию и стремление к пониманию окружающих. Они обладают врожденной способностью видеть скрытые аспекты событий, что делает их отличными советчиками и помощниками в трудных ситуациях.

                    Однако их склонность к самокритике и чрезмерной ответственности может стать препятствием на пути к личному счастью. Они часто берут на себя больше, чем могут выдержать, что приводит к эмоциональному истощению.

                    Научившись балансировать между помощью другим и заботой о себе, они смогут сохранить свою силу и энергию. Это поможет им не только быть полезными окружающим, но и достигать собственных целей.
                    """
                ),
                Subcategory(
                    title: "Рекомендации",
                    shortDescription: "Советы по гармонизации жизни в соответствии с вашим числом судьбы:",
                    mainDescription: """
                    - Устанавливайте границы: Не бойтесь отказывать, если это идет в ущерб вашему благополучию.
                    - Развивайте уверенность: Работайте над укреплением своей самооценки.
                    - Заботьтесь о себе: Находите время для отдыха и восстановления энергии.
                    - Умейте принимать помощь: Не стесняйтесь обращаться за поддержкой к другим.
                    - Практикуйте самоанализ: Размышляйте о своих потребностях и целях.

                    Следуя этим рекомендациям, вы сможете сохранить внутренний баланс и быть полезными окружающим, не теряя себя.
                    """
                )
            ]
        ),
        // MARK: - 13 Arkan
        13: ArkanInfo(
            arkanNumber: 13,
            title: "1. Число Судьбы (13 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Значение числа судьбы",
                    shortDescription: "Общее описание и характеристика полученного числа судьбы:",
                    mainDescription: """
                    Ваше число Судьбы - 13 Аркан. Число 13 символизирует трансформацию, конец одного этапа и начало нового. Люди с этим числом судьбы обладают способностью к глубоким внутренним изменениям и стремлением к обновлению. Они понимают, что для роста нужно отпускать старое и принимать новое.

                    Эти люди могут проходить через трудные жизненные перемены, которые помогают им раскрывать свой потенциал. Они обладают уникальной способностью видеть возможности там, где другие видят только потери. Их сила духа и готовность к переменам делают их примером для окружающих.

                    Однако страх перемен может иногда сдерживать их развитие. Им важно научиться доверять процессу трансформации, чтобы открывать для себя новые горизонты и достигать гармонии в жизни.
                    """
                ),
                Subcategory(
                    title: "Влияние на личность",
                    shortDescription: "Как число судьбы формирует ваши черты характера и поведение:",
                    mainDescription: """
                    Люди с числом судьбы 13 обладают стойкостью, смелостью и способностью адаптироваться к любым жизненным обстоятельствам. Они видят в переменах не угрозу, а возможность для роста. Их уверенность и решительность помогают им справляться с самыми сложными ситуациями.

                    Однако их склонность к постоянным изменениям может вызывать у окружающих ощущение нестабильности. Иногда они могут чувствовать себя изолированными, если не получают достаточной поддержки от других.

                    Им важно учиться делиться своими мыслями и эмоциями, чтобы укреплять свои связи с окружающими. Это поможет им справляться с трудностями и находить баланс между личным развитием и отношениями.
                    """
                ),
                Subcategory(
                    title: "Рекомендации",
                    shortDescription: "Советы по гармонизации жизни в соответствии с вашим числом судьбы:",
                    mainDescription: """
                    - Принимайте перемены: Учитесь видеть в них возможности для роста.
                    - Укрепляйте отношения: Поддерживайте открытое общение с близкими.
                    - Заботьтесь о своем здоровье: Регулярно отдыхайте и находите время для себя.
                    - Ставьте новые цели: Постоянно стремитесь к самосовершенствованию.
                    - Доверяйте себе: Верьте в свои силы и не бойтесь рисковать.

                    Эти советы помогут вам преодолевать трудности и находить гармонию в периоды перемен, раскрывая ваш внутренний потенциал.
                    """
                )
            ]
        ),
        // MARK: - 14 Arkan
        14: ArkanInfo(
            arkanNumber: 14,
            title: "1. Число Судьбы (14 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Значение числа судьбы",
                    shortDescription: "Общее описание и характеристика полученного числа судьбы:",
                    mainDescription: """
                    Ваше число Судьбы - 14 Аркан. Число 14 символизирует умеренность, баланс и гармонию. Люди с этим числом судьбы обладают способностью находить золотую середину в любых жизненных ситуациях. Они умеют сочетать рациональность и эмоциональность, что помогает им принимать взвешенные решения и сохранять внутреннее спокойствие.

                    Эти люди привносят гармонию в окружающий мир, действуя как посредники в конфликтах и направляя энергию на созидание. Они обладают терпением и умением приспосабливаться к обстоятельствам, что делает их надежными и уважаемыми членами общества.

                    Однако стремление избегать крайностей иногда приводит к недостаточной решительности или чрезмерной осторожности. Им важно развивать уверенность в своих силах, чтобы действовать смело, когда это необходимо, и продолжать стремиться к совершенству.
                    """
                ),
                Subcategory(
                    title: "Влияние на личность",
                    shortDescription: "Как число судьбы формирует ваши черты характера и поведение:",
                    mainDescription: """
                    Люди с числом судьбы 14 отличаются терпением, спокойствием и умением поддерживать баланс. Они легко адаптируются к переменам и способны видеть положительные стороны даже в сложных ситуациях. Их рациональный подход к жизни помогает им сохранять стабильность.

                    Однако иногда они могут избегать риска или быть слишком осторожными, что мешает им использовать свои возможности в полной мере. Стремление к гармонии иногда заставляет их подавлять собственные эмоции, чтобы не нарушить мир вокруг.

                    Развивая способность к решительным действиям и уверенность в своих решениях, они смогут достичь большего успеха и укрепить свои позиции в жизни.
                    """
                ),
                Subcategory(
                    title: "Рекомендации",
                    shortDescription: "Советы по гармонизации жизни в соответствии с вашим числом судьбы:",
                    mainDescription: """
                    - Развивайте уверенность: Учитесь принимать важные решения быстро и с уверенностью.
                    - Не избегайте риска: Иногда необходимо выходить за пределы своей зоны комфорта.
                    - Сохраняйте баланс: Не забывайте о собственных нуждах, стремясь помогать другим.
                    - Практикуйте самовыражение: Умейте говорить о своих желаниях и чувствах.
                    - Занимайтесь самосовершенствованием: Ищите новые способы раскрыть свой потенциал.

                    Эти рекомендации помогут вам сохранить гармонию в жизни и достичь успеха в любых начинаниях.
                    """
                )
            ]
        ),
        // MARK: - 15 Arkan
        15: ArkanInfo(
            arkanNumber: 15,
            title: "1. Число Судьбы (15 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Значение числа судьбы",
                    shortDescription: "Общее описание и характеристика полученного числа судьбы:",
                    mainDescription: """
                    Ваше число Судьбы - 15 Аркан. Число 15 символизирует страсть, соблазн и внутреннюю силу. Люди с этим числом судьбы обладают магнетизмом, харизмой и способностью притягивать к себе других. Они часто выступают источником вдохновения, создавая вокруг себя атмосферу энергичности и энтузиазма.

                    Эти люди склонны к интенсивным эмоциям и стремятся к ярким переживаниям. Их внутренняя энергия позволяет им достигать значительных высот в профессиональной и личной жизни. Однако, сильные желания и стремления иногда могут привести к зависимости или чрезмерному фокусированию на материальном.

                    Им важно находить баланс между своими желаниями и долгосрочными целями, чтобы избегать чрезмерной концентрации на удовольствиях и использовать свою энергию для позитивных изменений.
                    """
                ),
                Subcategory(
                    title: "Влияние на личность",
                    shortDescription: "Как число судьбы формирует ваши черты характера и поведение:",
                    mainDescription: """
                    Люди с числом судьбы 15 отличаются харизмой, силой воли и способностью влиять на окружающих. Их страсть к жизни и амбиции делают их яркими личностями, которые способны вести за собой других. Они любят быть в центре внимания и не боятся брать на себя ответственность.

                    Однако их стремление к удовлетворению своих желаний иногда может приводить к импульсивным решениям или конфликтам. Они могут быть склонны к излишнему фокусированию на материальных благах, что отвлекает их от духовного роста.

                    Им важно развивать осознанность и учиться направлять свою энергию на созидательные цели, чтобы раскрыть свой потенциал и достичь гармонии в жизни.
                    """
                ),
                Subcategory(
                    title: "Рекомендации",
                    shortDescription: "Советы по гармонизации жизни в соответствии с вашим числом судьбы:",
                    mainDescription: """
                    - Управляйте желаниями: Учитесь находить баланс между материальным и духовным.
                    - Контролируйте эмоции: Практикуйте медитацию и осознанность для управления своими чувствами.
                    - Ставьте долгосрочные цели: Направляйте свою энергию на развитие и достижение важных задач.
                    - Заботьтесь об окружающих: Используйте свою харизму для поддержки и вдохновения других.
                    - Поддерживайте здоровье: Регулярно занимайтесь физической активностью и находите время для отдыха.

                    Эти советы помогут вам достичь гармонии и использовать вашу энергию для создания позитивных изменений в жизни.
                    """
                )
            ]
        ),
        // MARK: - 16 Arkan
        16: ArkanInfo(
            arkanNumber: 16,
            title: "1. Число Судьбы (16 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Значение числа судьбы",
                    shortDescription: "Общее описание и характеристика полученного числа судьбы:",
                    mainDescription: """
                    Ваше число Судьбы - 16 Аркан. Число 16 символизирует разрушение старого, освобождение и внутреннее преображение. Люди с этим числом судьбы сталкиваются с моментами глубоких перемен, которые помогают избавиться от ненужного и построить что-то новое. Эти перемены учат их смотреть на жизнь с другой стороны и находить в трудностях возможности.

                    Эти люди обладают сильным характером и умением принимать вызовы судьбы. Они видят смысл в переменах и используют их для своего роста. Их способность находить внутренние ресурсы делает их примером для окружающих. Люди с этим числом часто становятся новаторами, которые вдохновляют других на изменения.

                    Однако частые перемены могут вызывать чувство неуверенности и страх перед будущим. Важно научиться принимать разрушение как необходимую часть обновления. Это помогает обрести внутреннюю устойчивость и силу для достижения новых высот.
                    """
                ),
                Subcategory(
                    title: "Влияние на личность",
                    shortDescription: "Как число судьбы формирует ваши черты характера и поведение:",
                    mainDescription: """
                    Люди с числом судьбы 16 обладают способностью к глубоким изменениям и стремлением к самопознанию. Они часто выступают инициаторами перемен, что делает их вдохновителями для других. Их стойкость помогает им преодолевать трудности и находить новые пути.

                    Однако их склонность к разрушению старого иногда может выглядеть как жесткость или излишний радикализм. Они могут испытывать стресс в условиях постоянных изменений, что сказывается на их эмоциональной стабильности.

                    Им важно находить баланс между желанием перемен и необходимостью поддерживать внутренний покой. Это поможет им строить гармоничные отношения с окружающими и сохранять внутреннюю энергию для достижения целей.
                    """
                ),
                Subcategory(
                    title: "Рекомендации",
                    shortDescription: "Советы по гармонизации жизни в соответствии с вашим числом судьбы:",
                    mainDescription: """
                    - Принимайте перемены: Видьте в них шанс для роста и нового начала.
                    - Работайте над стабильностью: Создавайте устойчивую основу для жизни, даже в условиях изменений.
                    - Заботьтесь о себе: Практикуйте методы восстановления внутренней гармонии, такие как медитация или йога.
                    - Поддерживайте связи: Обращайтесь за поддержкой к друзьям и близким в трудные моменты.
                    - Ставьте цели: Определяйте свои приоритеты и направляйте энергию на их достижение.

                    Эти советы помогут вам справляться с изменениями и использовать их для своего развития и успеха.
                    """
                )
            ]
        ),
        // MARK: - 17 Arkan
        17: ArkanInfo(
            arkanNumber: 17,
            title: "1. Число Судьбы (17 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Значение числа судьбы",
                    shortDescription: "Общее описание и характеристика полученного числа судьбы:",
                    mainDescription: """
                    Ваше число Судьбы - 17 Аркан. Число 17 символизирует надежду, вдохновение и устремленность к мечтам. Люди с этим числом судьбы обладают способностью видеть свет даже в самых сложных ситуациях. Их оптимизм и вера в лучшее помогают им вдохновлять окружающих и преодолевать трудности.

                    Эти люди отличаются ярким творческим потенциалом и способностью находить красоту в мелочах. Они часто становятся лидерами, которые ведут других за собой к новым горизонтам. Их энергия направлена на созидание и поиск глубокого смысла.

                    Однако излишний идеализм может привести к разочарованиям, если реальность не соответствует их ожиданиям. Им важно научиться сочетать свои высокие устремления с практическим подходом, чтобы воплощать свои мечты в жизнь.
                    """
                ),
                Subcategory(
                    title: "Влияние на личность",
                    shortDescription: "Как число судьбы формирует ваши черты характера и поведение:",
                    mainDescription: """
                    Люди с числом судьбы 17 обладают мощной энергетикой, творческим мышлением и стремлением к высоким идеалам. Они вдохновляют окружающих своими идеями и способностью видеть возможности там, где другие видят препятствия. Их позитивный настрой делает их центром притяжения для людей.

                    Однако их стремление к идеалам может иногда отдалять их от реальности. Они могут быть склонны игнорировать текущие проблемы в пользу больших мечтаний. Это создает сложности в отношениях и реализации их идей.

                    Им важно находить баланс между своими мечтами и реальными шагами для их достижения. Это поможет им сохранить гармонию и укрепить свою связь с окружающими.
                    """
                ),
                Subcategory(
                    title: "Рекомендации",
                    shortDescription: "Советы по гармонизации жизни в соответствии с вашим числом судьбы:",
                    mainDescription: """
                    - Сохраняйте реализм: Ставьте достижимые цели и постепенно двигайтесь к своим мечтам.
                    - Заботьтесь о себе: Поддерживайте свое физическое и эмоциональное здоровье.
                    - Уделяйте внимание мелочам: Радуйтесь небольшим победам на пути к большим достижениям.
                    - Развивайте сотрудничество: Работайте с людьми, которые поддерживают ваши идеи и стремления.
                    - Используйте свою энергию: Направляйте вдохновение на создание полезных и долговечных проектов.

                    Следуя этим рекомендациям, вы сможете воплощать свои мечты в жизнь и сохранять гармонию в отношениях с окружающими.
                    """
                )
            ]
        ),
        // MARK: - 18 Arkan
        18: ArkanInfo(
            arkanNumber: 18,
            title: "1. Число Судьбы (18 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Значение числа судьбы",
                    shortDescription: "Общее описание и характеристика полученного числа судьбы:",
                    mainDescription: """
                    Ваше число Судьбы - 18 Аркан. Число 18 символизирует тайны, интуицию и эмоциональную глубину. Люди с этим числом судьбы обладают яркой интуицией, тонким восприятием и богатым внутренним миром. Они часто чувствуют то, что скрыто от глаз окружающих, и могут разгадывать самые сложные загадки жизни.

                    Эти люди склонны к самоанализу и поиску смысла в каждом событии. Их способность видеть детали и понимать скрытые аспекты делает их отличными советчиками и вдохновителями. Однако их стремление к анализу иногда приводит к излишней тревожности и сомнениям в себе.

                    Им важно развивать доверие к своей интуиции и принимать свои эмоции как источник силы. Это поможет им справляться с внутренними противоречиями и использовать свою эмоциональную глубину для гармонизации жизни.
                    """
                ),
                Subcategory(
                    title: "Влияние на личность",
                    shortDescription: "Как число судьбы формирует ваши черты характера и поведение:",
                    mainDescription: """
                    Люди с числом судьбы 18 отличаются чуткостью, эмпатией и способностью глубоко понимать других. Их эмоциональная глубина позволяет им устанавливать искренние и прочные связи. Они часто становятся опорой для тех, кто ищет понимание и поддержку.

                    Однако их склонность к самокопанию может иногда приводить к эмоциональной нестабильности. Они могут быть склонны к излишним переживаниям и закрытости, что мешает им полностью раскрыть свой потенциал.

                    Развивая уверенность в себе и умение открыто выражать свои чувства, они смогут укрепить свои связи с окружающими и достичь гармонии в отношениях.
                    """
                ),
                Subcategory(
                    title: "Рекомендации",
                    shortDescription: "Советы по гармонизации жизни в соответствии с вашим числом судьбы:",
                    mainDescription: """
                    - Доверяйте интуиции: Используйте свои чувства как источник силы и вдохновения.
                    - Практикуйте расслабление: Уделяйте время медитации и техникам релаксации.
                    - Развивайте общение: Не бойтесь делиться своими эмоциями с близкими.
                    - Работайте над уверенностью: Учитесь принимать себя такими, какие вы есть.
                    - Ставьте цели: Фокусируйтесь на достижении важных для вас задач.

                    Эти советы помогут вам справляться с эмоциями и использовать их для создания гармоничной и успешной жизни.
                    """
                )
            ]
        ),
        // MARK: - 19 Arkan
        19: ArkanInfo(
            arkanNumber: 19,
            title: "1. Число Судьбы (19 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Значение числа судьбы",
                    shortDescription: "Общее описание и характеристика полученного числа судьбы:",
                    mainDescription: """
                    Ваше число Судьбы - 19 Аркан. Число 19 символизирует радость, успех и внутренний свет. Люди с этим числом судьбы обладают природной харизмой, оптимизмом и способностью вдохновлять окружающих. Они несут в мир свет и тепло, привлекая к себе внимание и симпатию.

                    Эти люди уверены в себе, энергичны и открыты для новых возможностей. Их стремление к достижению успеха и желание делиться радостью делают их источником вдохновения для окружающих. Они легко находят общий язык с людьми и умеют создавать атмосферу доверия.

                    Однако излишняя сосредоточенность на успехе иногда может приводить к переутомлению и эмоциональному истощению. Им важно находить баланс между стремлением к вершинам и заботой о своем внутреннем состоянии.
                    """
                ),
                Subcategory(
                    title: "Влияние на личность",
                    shortDescription: "Как число судьбы формирует ваши черты характера и поведение:",
                    mainDescription: """
                    Люди с числом судьбы 19 отличаются оптимизмом, энергией и уверенностью. Они легко привлекают к себе людей и становятся лидерами в своих кругах. Их умение вдохновлять других и находить радость в мелочах делает их источником позитива.

                    Однако их стремление к идеалам и постоянной активности иногда приводит к эмоциональному выгоранию. Они могут быть склонны игнорировать свои потребности, концентрируясь исключительно на успехе или помощи другим.

                    Им важно учиться находить время для восстановления и осознания своих истинных желаний. Это поможет им сохранить энергию и оставаться в гармонии с собой.
                    """
                ),
                Subcategory(
                    title: "Рекомендации",
                    shortDescription: "Советы по гармонизации жизни в соответствии с вашим числом судьбы:",
                    mainDescription: """
                    - Заботьтесь о себе: Уделяйте внимание своему физическому и эмоциональному здоровью.
                    - Сохраняйте баланс: Находите время для отдыха и общения с близкими.
                    - Радуйтесь мелочам: Учитесь находить счастье в простых повседневных моментах.
                    - Ставьте реалистичные цели: Разбивайте свои мечты на достижимые шаги.
                    - Вдохновляйте других: Используйте свою энергию для поддержки и мотивации окружающих.

                    Следуя этим рекомендациям, вы сможете сохранять свой внутренний свет и делиться им с окружающими, оставаясь успешными и счастливыми.
                    """
                )
            ]
        ),
        // MARK: - 20 Arkan
        20: ArkanInfo(
            arkanNumber: 20,
            title: "1. Число Судьбы (20 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Значение числа судьбы",
                    shortDescription: "Общее описание и характеристика полученного числа судьбы:",
                    mainDescription: """
                    Ваше число Судьбы - 20 Аркан. Число 20 символизирует возрождение, осознание и духовное пробуждение. Люди с этим числом судьбы обладают способностью к глубокому самопознанию и переосмыслению своего жизненного пути. Они часто сталкиваются с ситуациями, которые требуют честного взгляда на себя и принятия прошлого.

                    Эти люди стремятся к внутренней трансформации и развитию. Они чувствуют потребность помогать другим осознавать свои возможности и вдохновлять на изменения. Их сила заключается в способности видеть суть вещей и находить смысл даже в самых сложных обстоятельствах.

                    Однако склонность к саморефлексии может иногда приводить к излишней самокритике и ощущению вины за прошлое. Им важно учиться прощать себя и воспринимать ошибки как часть жизненного пути, чтобы продолжать двигаться вперед с уверенностью и гармонией.
                    """
                ),
                Subcategory(
                    title: "Влияние на личность",
                    shortDescription: "Как число судьбы формирует ваши черты характера и поведение:",
                    mainDescription: """
                    Люди с числом судьбы 20 обладают высокой степенью осознанности и умением видеть глубинные связи между событиями. Они способны вдохновлять других на перемены и помогать им в принятии сложных решений. Их стремление к честности и справедливости делает их надежными друзьями и партнерами.

                    Однако их склонность к размышлениям о прошлом иногда мешает им сосредоточиться на настоящем. Они могут быть чрезмерно критичны к себе и испытывать трудности в принятии своих ошибок.

                    Развивая умение жить в моменте и отпускать старые обиды, они смогут раскрыть свой потенциал и построить гармоничные отношения с окружающими.
                    """
                ),
                Subcategory(
                    title: "Рекомендации",
                    shortDescription: "Советы по гармонизации жизни в соответствии с вашим числом судьбы:",
                    mainDescription: """
                    - Прощайте себя: Умейте воспринимать ошибки как уроки, а не как неудачи.
                    - Живите в настоящем: Сосредотачивайтесь на том, что вы можете изменить здесь и сейчас.
                    - Поддерживайте других: Делитесь своим опытом и вдохновляйте на перемены.
                    - Работайте над уверенностью: Укрепляйте веру в свои силы и возможности.
                    - Заботьтесь о духовном развитии: Практикуйте медитации и техники саморазвития.

                    Следуя этим рекомендациям, вы сможете использовать свою осознанность для достижения гармонии и личностного роста.
                    """
                )
            ]
        ),
        // MARK: - 21 Arkan
        21: ArkanInfo(
            arkanNumber: 21,
            title: "1. Число Судьбы (21 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Значение числа судьбы",
                    shortDescription: "Общее описание и характеристика полученного числа судьбы:",
                    mainDescription: """
                    Ваше число Судьбы - 21 Аркан. Число 21 символизирует завершенность, гармонию и внутренний покой. Люди с этим числом судьбы обладают способностью видеть жизнь как целостный процесс, где каждый момент имеет свое место и значение. Они достигают успеха благодаря умению гармонично сочетать усилия и интуицию.

                    Эти люди излучают уверенность и стабильность. Они часто становятся вдохновением для других, демонстрируя, как можно жить в гармонии с собой и окружающим миром. Их способность завершать начатое делает их надежными партнерами и коллегами.

                    Однако стремление к совершенству иногда может приводить к завышенным ожиданиям от себя и окружающих. Им важно научиться принимать несовершенства и находить радость в процессе, а не только в результате.
                    """
                ),
                Subcategory(
                    title: "Влияние на личность",
                    shortDescription: "Как число судьбы формирует ваши черты характера и поведение:",
                    mainDescription: """
                    Люди с числом судьбы 21 отличаются мудростью, устойчивостью и способностью сохранять спокойствие в любых обстоятельствах. Их умение видеть картину в целом помогает им принимать взвешенные решения и достигать поставленных целей. Они излучают уверенность и надежность, что делает их притягательными для окружающих.

                    Однако стремление к идеалу иногда приводит к разочарованиям, если реальность не соответствует их ожиданиям. Они могут быть склонны к излишнему контролю и трудностям в принятии спонтанных решений.

                    Им важно развивать гибкость и учиться находить радость в мелочах, чтобы сохранять баланс между стремлением к совершенству и наслаждением жизнью.
                    """
                ),
                Subcategory(
                    title: "Рекомендации",
                    shortDescription: "Советы по гармонизации жизни в соответствии с вашим числом судьбы:",
                    mainDescription: """
                    - Принимайте несовершенства: Помните, что идеал недостижим, и наслаждайтесь процессом.
                    - Работайте над гибкостью: Учитесь отпускать контроль и доверять жизни.
                    - Заботьтесь о балансе: Найдите равновесие между достижением целей и отдыхом.
                    - Поддерживайте связи: Делитесь своими успехами и радостью с близкими.
                    - Продолжайте развиваться: Стремитесь к новым вершинам, сохраняя гармонию в душе.

                    Эти рекомендации помогут вам сохранять внутренний покой и вдохновлять окружающих своим примером.
                    """
                )
            ]
        ),
        // MARK: - 22 Arkan
        22: ArkanInfo(
            arkanNumber: 22,
            title: "1. Число Судьбы (22 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Значение числа судьбы",
                    shortDescription: "Общее описание и характеристика полученного числа судьбы:",
                    mainDescription: """
                    Ваше число Судьбы - 22 Аркан. Число 22 символизирует свободу, спонтанность и открытость новым возможностям. Люди с этим числом судьбы обладают яркой харизмой и внутренним светом, который позволяет им легко адаптироваться к любым обстоятельствам. Их природная легкость и оптимизм притягивают к ним людей и новые возможности.

                    Эти люди склонны жить настоящим моментом, не оглядываясь назад и не переживая о будущем. Они верят в силу интуиции и часто следуют своему внутреннему голосу, что помогает им находить неожиданные решения и избегать рутинных ограничений.

                    Однако чрезмерная спонтанность может приводить к отсутствию структуры в жизни. Им важно учиться сочетать свою свободу с ответственностью, чтобы их действия приносили долгосрочные результаты и укрепляли их жизненную основу.
                    """
                ),
                Subcategory(
                    title: "Влияние на личность",
                    shortDescription: "Как число судьбы формирует ваши черты характера и поведение:",
                    mainDescription: """
                    Люди с числом судьбы 22 отличаются креативностью, гибкостью и способностью находить радость в жизни. Они быстро адаптируются к изменениям и видят в них возможность для роста. Их открытость и искренность делают их привлекательными для других, а их идеи вдохновляют на перемены.

                    Однако склонность к спонтанности иногда приводит к недальновидным решениям или трудностям в реализации планов. Они могут быть склонны игнорировать мелкие детали или откладывать важные задачи, что создает стресс.

                    Им важно развивать умение находить баланс между спонтанностью и структурированным подходом, чтобы их жизнь оставалась полной радости и успехов.
                    """
                ),
                Subcategory(
                    title: "Рекомендации",
                    shortDescription: "Советы по гармонизации жизни в соответствии с вашим числом судьбы:",
                    mainDescription: """
                    - Развивайте ответственность: Уделяйте внимание планированию и следованию своим целям.
                    - Доверяйте интуиции: Используйте свою способность к принятию спонтанных решений.
                    - Заботьтесь о балансе: Находите время для отдыха и восстановления сил.
                    - Поддерживайте связи: Делитесь своими идеями и вдохновляйте других.
                    - Ставьте реалистичные цели: Определяйте задачи, которые помогут вам реализовать свой потенциал.

                    Эти советы помогут вам сочетать спонтанность и структурированность, создавая успешную и гармоничную жизнь.
                    """
                )
            ]
        )
    ]
}
