//
//  RelationshipsArkans.swift
//  DestinyMatrix
//
//  Created by Иван Семикин on 07/12/2024.
//

import Foundation

struct RelationshipsArkans {
    static let allArkans: ArkanDictionary = [
        // MARK: - 1 Arkan
        1: ArkanInfo(
            title: "3. Отношения (1 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Романтические отношения",
                    shortDescription: "Перспективы в любви и браке, поиск гармонии в личной жизни.",
                    mainDescription: """
                    Ваше число в отношениях - 1 Аркан. В романтической сфере это число символизирует инициативность, энергичность и желание быть лидером в отношениях. Люди с 1 Арканом склонны брать на себя ответственность за развитие любовных связей, проявляя активность и решимость. Они уверены в своих силах, что привлекает партнёров, ценящих надёжность и амбициозность.

                    В любви они ищут взаимное уважение и признание, стремясь построить отношения, основанные на честности и искренности. Однако их лидерские качества иногда могут превращаться в стремление доминировать, что может вызывать напряжённость в паре. 

                    Для гармоничных отношений важно развивать умение слушать и учитывать желания партнёра, находить баланс между инициативой и уступчивостью. Это поможет укрепить связь и избежать конфликтов.
                    """
                ),
                Subcategory(
                    title: "Дружеские связи",
                    shortDescription: "Построение и укрепление дружеских отношений.",
                    mainDescription: """
                    Люди с 1 Арканом склонны быть инициаторами дружеских связей. Они обладают харизмой и уверенностью, что привлекает окружающих и делает их естественными лидерами в кругу друзей. Их энергия вдохновляет и мотивирует других, а способность брать на себя ответственность делает их надёжными друзьями.

                    Однако их стремление к лидерству иногда может восприниматься как излишняя требовательность. Для укрепления дружеских связей важно проявлять больше гибкости и учитывать потребности других. Дружба для них становится особенно прочной, если они находят людей, которые разделяют их взгляды и ценности.

                    Важной задачей является развитие терпимости и умения делиться лидерской позицией. Это поможет избежать недопонимания и создать глубокие и доверительные отношения.
                    """
                ),
                Subcategory(
                    title: "Семейные отношения",
                    shortDescription: "Взаимодействие с членами семьи и родственниками.",
                    mainDescription: """
                    В семейных отношениях люди с 1 Арканом часто занимают роль опоры и лидера. Они стремятся обеспечить близким стабильность и безопасность, принимая на себя ключевые решения. Их амбиции распространяются и на семью, так как они хотят видеть своих близких успешными и счастливыми.

                    Однако иногда их стремление контролировать ситуацию может создавать напряжение. Для гармоничных семейных отношений важно давать другим членам семьи больше свободы и проявлять гибкость. Развитие эмпатии и умение прислушиваться к мнению близких укрепят семейные узы.

                    Семья для людей с 1 Арканом является важной основой, где они могут реализовать свои лидерские качества и поддерживать своих близких в достижении их целей.
                    """
                ),
                Subcategory(
                    title: "Социальная адаптация",
                    shortDescription: "Умение общаться, налаживать контакты и интегрироваться в коллективы.",
                    mainDescription: """
                    Люди с 1 Арканом обладают природной способностью к социализации и лидерству. Они уверенно вступают в новые коллективы и быстро завоёвывают внимание окружающих благодаря своей харизме и решительности. Их уверенность в себе помогает им налаживать полезные контакты и вдохновлять других.

                    Однако их стремление всегда быть на виду может вызывать ревность или недовольство у некоторых людей. Для успешной социальной адаптации важно работать над умением делиться инициативой и учитывать мнение других.

                    Укрепление навыков дипломатии и толерантности поможет им более эффективно взаимодействовать с коллективом, создавая гармоничные и плодотворные отношения.
                    """
                ),
                Subcategory(
                    title: "Совместимость",
                    shortDescription: "Анализ с кем легче установить гармоничные и долгосрочные отношения.",
                    mainDescription: """
                    Люди с 1 Арканом лучше всего совместимы с партнёрами, которые ценят их лидерские качества и готовы поддерживать их стремление к успеху. Хорошая совместимость складывается с теми, кто обладает терпением и способностью вдохновлять их на новые достижения.

                    Отличные отношения возможны с людьми, которые могут сбалансировать их энергичность своей спокойной уверенностью. Однако они могут испытывать трудности с партнёрами, которые также стремятся доминировать, так как это может приводить к конфликтам.

                    Для успешных и долгосрочных отношений важно развивать умение уступать и уважать индивидуальность каждого. Это создаст прочную основу для гармоничных связей.
                    """
                )
            ]
        ),
        // MARK: - 2 Arkan
        2: ArkanInfo(
            title: "3. Отношения (2 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Романтические отношения",
                    shortDescription: "Перспективы в любви и браке, поиск гармонии в личной жизни.",
                    mainDescription: """
                    Ваше число в отношениях - 2 Аркан. Это число символизирует гармонию, равновесие и партнёрство. Люди с этим числом судьбы ищут в романтических отношениях поддержку, эмоциональную близость и взаимопонимание. Они склонны к проявлению чуткости и заботы, что делает их идеальными партнёрами для построения глубоких и устойчивых отношений.

                    В любви они ценят равноправие и способность делиться эмоциями. Их романтическая натура помогает им создавать атмосферу доверия и гармонии. Однако их склонность к чрезмерной чувствительности может приводить к обидам, если партнёр не всегда отвечает на их эмоции.

                    Для укрепления отношений важно развивать уверенность в себе и не забывать о своих потребностях. Это позволит им строить гармоничные связи, в которых обе стороны будут чувствовать себя значимыми.
                    """
                ),
                Subcategory(
                    title: "Дружеские связи",
                    shortDescription: "Построение и укрепление дружеских отношений.",
                    mainDescription: """
                    Люди с 2 Арканом являются отличными друзьями благодаря своей способности слушать и понимать других. Они ценят искренность и доверие в дружбе, а также умеют поддерживать даже в сложных ситуациях. Их эмпатия и готовность прийти на помощь делают их незаменимыми для близких.

                    Однако их высокая чувствительность может приводить к тому, что они переживают из-за малейших конфликтов. Для укрепления дружбы важно научиться воспринимать мелкие разногласия как часть здоровых отношений.

                    Развивая навыки эмоциональной устойчивости и учась сохранять границы, они смогут строить крепкие и долговечные дружеские связи.
                    """
                ),
                Subcategory(
                    title: "Семейные отношения",
                    shortDescription: "Взаимодействие с членами семьи и родственниками.",
                    mainDescription: """
                    В семейных отношениях люди с 2 Арканом стремятся к миру и согласию. Они готовы вкладывать время и усилия в поддержание гармонии, ценят семейные традиции и делают всё возможное, чтобы создать тёплую атмосферу в доме. Их способность понимать и принимать других делает их важными членами семьи.

                    Однако их склонность избегать конфликтов иногда может приводить к тому, что они подавляют свои собственные чувства. Для гармонии важно не бояться открыто обсуждать свои переживания с близкими.

                    Семья для них — это место, где они могут проявить свою заботу и получить эмоциональную поддержку. Их цель — укрепить семейные узы через искренность и доверие.
                    """
                ),
                Subcategory(
                    title: "Социальная адаптация",
                    shortDescription: "Умение общаться, налаживать контакты и интегрироваться в коллективы.",
                    mainDescription: """
                    Люди с 2 Арканом легко адаптируются в социальных ситуациях благодаря своей дипломатичности и умению находить общий язык с разными людьми. Они предпочитают избегать конфликтов и стремятся создать комфортную атмосферу в коллективе.

                    Их способность чувствовать настроение окружающих позволяет им устанавливать тёплые отношения с коллегами и друзьями. Однако их чувствительность иногда может становиться препятствием, если они воспринимают критику слишком близко к сердцу.

                    Для успешной социальной адаптации важно работать над уверенностью в себе и учиться принимать конструктивную обратную связь. Это поможет им эффективно взаимодействовать с окружающими.
                    """
                ),
                Subcategory(
                    title: "Совместимость",
                    shortDescription: "Анализ с кем легче установить гармоничные и долгосрочные отношения.",
                    mainDescription: """
                    Люди с 2 Арканом лучше всего совместимы с партнёрами, которые ценят эмоциональную глубину и готовы к построению равноправных отношений. Отличное партнёрство складывается с теми, кто обладает терпимостью и умеет поддерживать их стремление к гармонии.

                    Хорошая совместимость возможна с людьми, которые способны уважать их чувствительность и деликатность. Однако они могут испытывать трудности в отношениях с партнёрами, которые не готовы к эмоциональной открытости или имеют склонность к доминированию.

                    Для гармоничных и долгосрочных отношений важно развивать способность к самоутверждению и сохранять баланс между своими потребностями и потребностями партнёра.
                    """
                )
            ]
        ),
        // MARK: - 3 Arkan
        3: ArkanInfo(
            title: "3. Отношения (3 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Романтические отношения",
                    shortDescription: "Перспективы в любви и браке, поиск гармонии в личной жизни.",
                    mainDescription: """
                    Ваше число в отношениях - 3 Аркан. Это число символизирует творчество, радость и эмоциональную открытость. Люди с этим Арканом привносят лёгкость и вдохновение в свои романтические отношения. Они обладают уникальной способностью выражать свои чувства через слова, действия или творчество, что делает их увлекательными и привлекательными партнёрами.

                    В любви они стремятся к искренности и взаимопониманию, ценят эмоциональную связь и готовы делиться своими радостями с партнёром. Однако их яркая натура иногда может приводить к поверхностности в отношениях или трудностям в принятии обязательств.

                    Для построения гармоничных отношений важно находить баланс между радостью и ответственностью, а также уделять внимание глубоким эмоциональным связям. Это позволит укрепить доверие и сделать союз стабильным и вдохновляющим.
                    """
                ),
                Subcategory(
                    title: "Дружеские связи",
                    shortDescription: "Построение и укрепление дружеских отношений.",
                    mainDescription: """
                    Люди с 3 Арканом легко привлекают друзей благодаря своей харизме и оптимизму. Они приносят радость и вдохновение в дружеские отношения, становясь душой компании. Их умение слушать и делиться позитивной энергией делает их ценными друзьями.

                    Однако их склонность к поверхностному общению иногда может мешать построению глубоких связей. Для укрепления дружбы важно уделять внимание чувствам и интересам других, а не только демонстрировать свои таланты.

                    Если они научатся уделять время построению более глубоких и искренних связей, их дружеские отношения станут ещё более прочными и наполненными.
                    """
                ),
                Subcategory(
                    title: "Семейные отношения",
                    shortDescription: "Взаимодействие с членами семьи и родственниками.",
                    mainDescription: """
                    В семейных отношениях люди с 3 Арканом стремятся создать атмосферу радости и уюта. Они охотно участвуют в семейных событиях, приносят вдохновение и лёгкость в общение с близкими. Их способность находить общий язык с разными членами семьи делает их связующим звеном.

                    Однако их стремление к веселью иногда может мешать восприятию серьёзных тем. Для укрепления семейных связей важно уделять внимание эмоциям и переживаниям других членов семьи, особенно в трудные моменты.

                    Семья для них является местом, где они могут проявить свою творческую натуру и дарить окружающим свою любовь и заботу.
                    """
                ),
                Subcategory(
                    title: "Социальная адаптация",
                    shortDescription: "Умение общаться, налаживать контакты и интегрироваться в коллективы.",
                    mainDescription: """
                    Люди с 3 Арканом обладают врождённой способностью к социализации. Они легко входят в новые коллективы, привносят радость и вдохновение в общение, становясь центром внимания. Их оптимизм и креативность помогают им быстро налаживать связи и находить общие интересы с окружающими.

                    Однако иногда их склонность к яркому самовыражению может восприниматься как излишняя демонстративность. Для успешной социальной адаптации важно учиться слушать и учитывать интересы других людей.

                    Умение находить баланс между своей энергией и вниманием к окружающим поможет им создавать гармоничные отношения в любых социальных группах.
                    """
                ),
                Subcategory(
                    title: "Совместимость",
                    shortDescription: "Анализ с кем легче установить гармоничные и долгосрочные отношения.",
                    mainDescription: """
                    Люди с 3 Арканом лучше всего совместимы с партнёрами, которые ценят их креативность и лёгкость в общении. Отличные отношения возможны с теми, кто вдохновляет их на творчество и разделяет их оптимизм. Их яркая энергия привлекает людей, ищущих вдохновение и радость в отношениях.

                    Трудности могут возникнуть с партнёрами, которые слишком серьёзны или склонны к критике, так как это может подавлять их стремление к самовыражению. Для успешного союза важно искать баланс между их эмоциональной открытостью и практичностью.

                    Если они научатся быть более внимательными к эмоциям партнёра и развивать способность к компромиссу, их отношения станут ещё более прочными и гармоничными.
                    """
                )
            ]
        ),
        // MARK: - 4 Arkan
        4: ArkanInfo(
            title: "3. Отношения (4 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Романтические отношения",
                    shortDescription: "Перспективы в любви и браке, поиск гармонии в личной жизни.",
                    mainDescription: """
                    Ваше число в отношениях - 4 Аркан. Это число символизирует стабильность, ответственность и надёжность. Люди с этим Арканом стремятся к созданию устойчивых и долгосрочных романтических связей. Они подходят к любви с практической точки зрения, ценя доверие, преданность и взаимное уважение.

                    В отношениях они проявляют заботу и стараются создать для партнёра комфорт и уверенность в завтрашнем дне. Их главная цель — построить прочный союз, основанный на взаимной поддержке. Однако их склонность к излишней серьёзности и контролю может вызывать напряжение в паре.

                    Для гармоничных отношений важно проявлять гибкость и уделять внимание эмоциональной стороне любви. Это поможет избежать рутины и поддерживать тёплую атмосферу в отношениях.
                    """
                ),
                Subcategory(
                    title: "Дружеские связи",
                    shortDescription: "Построение и укрепление дружеских отношений.",
                    mainDescription: """
                    Люди с 4 Арканом строят дружеские отношения на принципах надёжности и лояльности. Они ценят постоянство и преданность, поэтому их друзья знают, что могут положиться на них в любых ситуациях. Их практический подход к дружбе делает их незаменимыми в сложные моменты.

                    Однако их склонность к контролю и излишнему анализу может создавать напряжение в дружбе. Для укрепления связей важно проявлять больше гибкости и позволять друзьям быть самими собой.

                    Развивая навыки открытого общения и готовность принимать различия, они смогут строить крепкие и искренние дружеские отношения.
                    """
                ),
                Subcategory(
                    title: "Семейные отношения",
                    shortDescription: "Взаимодействие с членами семьи и родственниками.",
                    mainDescription: """
                    В семейных отношениях люди с 4 Арканом проявляют ответственность и стремятся поддерживать стабильность. Они готовы взять на себя роль лидера, который обеспечивает порядок и комфорт для всей семьи. Их практичность и трудолюбие помогают создавать надёжную основу для совместной жизни.

                    Однако их стремление к контролю иногда может восприниматься как давление. Для гармонии важно учитывать мнение других членов семьи и позволять им вносить свой вклад в семейные дела.

                    Семья для них — это основа, где они могут реализовать свои ценности и принципы. Развивая способность к компромиссу и гибкости, они смогут укрепить семейные узы.
                    """
                ),
                Subcategory(
                    title: "Социальная адаптация",
                    shortDescription: "Умение общаться, налаживать контакты и интегрироваться в коллективы.",
                    mainDescription: """
                    Люди с 4 Арканом предпочитают стабильные и предсказуемые социальные связи. Они чувствуют себя уверенно в коллективах, где ценятся порядок и ответственность. Их надёжность и серьёзность часто делают их ключевыми фигурами в группах, на которых можно положиться.

                    Однако их склонность к строгости и анализу может мешать установлению более лёгких и непринуждённых связей. Для успешной социальной адаптации важно развивать гибкость и умение воспринимать критику без обид.

                    Создавая баланс между серьёзностью и дружелюбием, они смогут легко интегрироваться в любые коллективы и создавать гармоничные отношения.
                    """
                ),
                Subcategory(
                    title: "Совместимость",
                    shortDescription: "Анализ с кем легче установить гармоничные и долгосрочные отношения.",
                    mainDescription: """
                    Люди с 4 Арканом совместимы с партнёрами, которые ценят стабильность, ответственность и преданность. Отличные отношения складываются с теми, кто готов строить совместное будущее, опираясь на взаимное уважение и доверие.

                    Они могут испытывать трудности в отношениях с людьми, которые склонны к спонтанности или избегают обязательств, так как это противоречит их природе. Для успешного союза важно искать партнёра, который разделяет их стремление к порядку и безопасности.

                    Развивая способность к открытости и принятию изменений, они смогут создать долгосрочные и гармоничные отношения, основанные на взаимной поддержке и любви.
                    """
                )
            ]
        ),
        // MARK: - 5 Arkan
        5: ArkanInfo(
            title: "3. Отношения (5 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Романтические отношения",
                    shortDescription: "Перспективы в любви и браке, поиск гармонии в личной жизни.",
                    mainDescription: """
                    Ваше число в отношениях - 5 Аркан. Этот Аркан символизирует свободу, перемены и страсть. Люди с этим числом судьбы обладают сильным желанием исследовать новые горизонты и избегают рутинности в отношениях. Они стремятся к ярким эмоциям, спонтанности и искренности в любви.

                    В романтической сфере они ценят партнёров, которые разделяют их жажду приключений и открытость к новому опыту. Однако их стремление к свободе иногда может восприниматься как непостоянство, что может вызывать напряжение в отношениях.

                    Для гармонии в любви важно находить баланс между стремлением к независимости и готовностью к взаимной ответственности. Это поможет им построить отношения, наполненные страстью и доверием.
                    """
                ),
                Subcategory(
                    title: "Дружеские связи",
                    shortDescription: "Построение и укрепление дружеских отношений.",
                    mainDescription: """
                    Люди с 5 Арканом привлекают друзей своей энергией, харизмой и жизнерадостностью. Они склонны быть инициаторами ярких мероприятий, что делает их центром внимания в дружеском кругу. Их динамичность вдохновляет окружающих и мотивирует на новые свершения.

                    Однако их склонность к непостоянству может вызывать трудности в долгосрочной дружбе. Для укрепления связей важно проявлять больше внимания и стабильности по отношению к друзьям.

                    Развивая навыки слушания и умение уделять время укреплению дружбы, они смогут создать глубокие и прочные отношения, которые будут основаны на доверии и взаимопонимании.
                    """
                ),
                Subcategory(
                    title: "Семейные отношения",
                    shortDescription: "Взаимодействие с членами семьи и родственниками.",
                    mainDescription: """
                    В семейных отношениях люди с 5 Арканом стремятся к динамике и разнообразию. Они вдохновляют своих близких на перемены, помогая им видеть новые перспективы. Их любовь к свободе и творчеству может создавать интересную и насыщенную семейную атмосферу.

                    Однако их нежелание придерживаться строгих правил иногда может приводить к недоразумениям. Для гармоничных отношений важно уважать традиции семьи и находить компромиссы между своими стремлениями и потребностями близких.

                    Семья для них — это место, где они могут делиться своей энергией и вдохновлять окружающих на самореализацию. Укрепление взаимопонимания и открытого общения станет основой для прочных семейных уз.
                    """
                ),
                Subcategory(
                    title: "Социальная адаптация",
                    shortDescription: "Умение общаться, налаживать контакты и интегрироваться в коллективы.",
                    mainDescription: """
                    Люди с 5 Арканом легко адаптируются в новых социальных кругах благодаря своему обаянию и уверенности. Они быстро находят общий язык с окружающими, становясь источником вдохновения и идей. Их энергичность и оптимизм делают их популярными в коллективе.

                    Однако их склонность к переменам и независимости может мешать установлению глубоких связей. Для успешной социальной адаптации важно учиться проявлять терпение и учитывать интересы других.

                    Создавая баланс между своей свободолюбивой натурой и умением работать в команде, они смогут эффективно взаимодействовать с окружающими и достигать взаимопонимания.
                    """
                ),
                Subcategory(
                    title: "Совместимость",
                    shortDescription: "Анализ с кем легче установить гармоничные и долгосрочные отношения.",
                    mainDescription: """
                    Люди с 5 Арканом наиболее совместимы с партнёрами, которые ценят свободу, динамику и стремление к новым впечатлениям. Хорошие отношения складываются с теми, кто готов принимать их независимость и поддерживать их стремление к развитию.

                    Трудности могут возникнуть с партнёрами, которые ищут стабильности и не готовы к изменениям. Для успешного союза важно искать баланс между их желанием свободы и потребностью партнёра в надёжности.

                    Укрепляя свою способность к компромиссу и демонстрируя искреннюю заботу, они смогут создать гармоничные и долгосрочные отношения, основанные на уважении и любви.
                    """
                )
            ]
        ),
        // MARK: - 6 Arkan
        6: ArkanInfo(
            title: "3. Отношения (6 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Романтические отношения",
                    shortDescription: "Перспективы в любви и браке, поиск гармонии в личной жизни.",
                    mainDescription: """
                    Ваше число в отношениях - 6 Аркан. Этот Аркан символизирует любовь, гармонию и ответственность в отношениях. Люди с этим числом судьбы обладают врождённой способностью заботиться о своём партнёре и создавать тёплую атмосферу. Их главная цель в романтических отношениях — создать союз, основанный на взаимопонимании и поддержке.

                    В любви они часто берут на себя роль заботливого и ответственного партнёра. Они стремятся сделать отношения комфортными и счастливыми, уделяя внимание деталям. Однако их стремление контролировать ситуацию или брать на себя слишком много ответственности иногда может приводить к перенапряжению.

                    Для гармонии в любви важно развивать способность делегировать и позволять партнёру проявлять инициативу. Это укрепит доверие и сделает отношения более сбалансированными и счастливыми.
                    """
                ),
                Subcategory(
                    title: "Дружеские связи",
                    shortDescription: "Построение и укрепление дружеских отношений.",
                    mainDescription: """
                    Люди с 6 Арканом являются надёжными и преданными друзьями. Они готовы прийти на помощь в любую минуту и часто становятся эмоциональной поддержкой для своих близких. Их искренность и заботливость притягивают людей, которые ценят искренние и доверительные отношения.

                    Однако их стремление решать чужие проблемы иногда может приводить к перенапряжению. Для сохранения крепких дружеских связей важно помнить о своих потребностях и уметь устанавливать личные границы.

                    Уделяя внимание балансу между помощью другим и заботой о себе, они смогут создать дружбу, которая будет наполнять их радостью и вдохновением.
                    """
                ),
                Subcategory(
                    title: "Семейные отношения",
                    shortDescription: "Взаимодействие с членами семьи и родственниками.",
                    mainDescription: """
                    В семейных отношениях люди с 6 Арканом проявляют заботу, терпение и стремление к гармонии. Они готовы вкладывать время и энергию в укрепление семейных уз, делая всё возможное для счастья своих близких. Их стремление к стабильности и комфорту помогает создавать тёплую атмосферу в доме.

                    Однако их склонность брать на себя слишком много ответственности иногда может приводить к выгоранию. Для гармоничных отношений важно делегировать обязанности и учитывать мнение всех членов семьи.

                    Развивая открытое общение и уважение к личным границам, они смогут укрепить семейные связи и создать счастливую и уютную атмосферу в семье.
                    """
                ),
                Subcategory(
                    title: "Социальная адаптация",
                    shortDescription: "Умение общаться, налаживать контакты и интегрироваться в коллективы.",
                    mainDescription: """
                    Люди с 6 Арканом обладают даром создания гармонии в социальных группах. Их умение слушать, поддерживать и решать конфликты делает их незаменимыми в коллективе. Они предпочитают работать в стабильных условиях, где ценятся доверие и взаимная помощь.

                    Однако их стремление избегать конфликтов иногда мешает им выражать свои собственные идеи. Для успешной социальной адаптации важно развивать уверенность в себе и умение чётко формулировать свои мысли.

                    Сохраняя баланс между стремлением к гармонии и защитой своих интересов, они смогут эффективно взаимодействовать с окружающими и достигать уважения в коллективе.
                    """
                ),
                Subcategory(
                    title: "Совместимость",
                    shortDescription: "Анализ с кем легче установить гармоничные и долгосрочные отношения.",
                    mainDescription: """
                    Люди с 6 Арканом совместимы с теми, кто ценит стабильность, ответственность и гармонию. Они прекрасно ладят с партнёрами, которые готовы разделить их стремление к созданию уютной и комфортной обстановки. Их надёжность и искренность привлекают тех, кто ищет в отношениях эмоциональную стабильность.

                    Однако трудности могут возникнуть с партнёрами, которые склонны к излишней независимости или избегают обязательств. Для успешного союза важно находить баланс между заботой о партнёре и уважением к его личным границам.

                    Укрепляя способность к взаимопониманию и совместному решению задач, они смогут создать долговечные отношения, основанные на любви и уважении.
                    """
                )
            ]
        ),
        // MARK: - 7 Arkan
        7: ArkanInfo(
            title: "3. Отношения (7 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Романтические отношения",
                    shortDescription: "Перспективы в любви и браке, поиск гармонии в личной жизни.",
                    mainDescription: """
                    Ваше число в отношениях - 7 Аркан. Этот Аркан символизирует внутреннюю глубину, мудрость и стремление к духовному единству. Люди с этим числом судьбы в отношениях ищут не просто партнёра, а человека, с которым они смогут разделить свои идеалы и видение жизни. Для них важна не только эмоциональная, но и интеллектуальная связь.

                    В романтической сфере они стремятся к искренности и взаимопониманию, избегая поверхностных связей. Они часто предпочитают сначала изучить партнёра, прежде чем вступать в глубокие отношения. Однако их склонность к изоляции или чрезмерному анализу может иногда мешать установлению эмоциональной близости.

                    Для гармонии в любви важно учиться открыто выражать свои чувства и доверять партнёру. Это поможет укрепить отношения и создать прочный союз, основанный на взаимной поддержке и уважении.
                    """
                ),
                Subcategory(
                    title: "Дружеские связи",
                    shortDescription: "Построение и укрепление дружеских отношений.",
                    mainDescription: """
                    Люди с 7 Арканом часто выбирают узкий круг друзей, с которыми они могут обсудить глубокие темы и разделить свои мысли. Они ценят интеллектуальное общение и предпочитают друзей, которые разделяют их интересы и жизненные взгляды. 

                    Однако их склонность к уединению и анализу иногда может создавать барьеры в установлении новых связей. Для укрепления дружбы важно развивать открытость и проявлять инициативу в общении с близкими.

                    Уделяя внимание поддержанию искренних и глубоких дружеских отношений, они смогут создать круг друзей, который будет приносить радость и вдохновение.
                    """
                ),
                Subcategory(
                    title: "Семейные отношения",
                    shortDescription: "Взаимодействие с членами семьи и родственниками.",
                    mainDescription: """
                    В семейных отношениях люди с 7 Арканом проявляют мудрость и стремление к гармонии. Они часто становятся наставниками для своих близких, помогая им находить решения в сложных ситуациях. Их подход к взаимодействию с семьёй основывается на терпении и стремлении к духовному росту.

                    Однако их склонность к уединению может восприниматься как отстранённость. Для укрепления семейных связей важно учиться выражать свои эмоции и активно участвовать в семейной жизни.

                    Создавая баланс между своей потребностью в уединении и вниманием к близким, они смогут укрепить семейные узы и стать источником вдохновения для своих родственников.
                    """
                ),
                Subcategory(
                    title: "Социальная адаптация",
                    shortDescription: "Умение общаться, налаживать контакты и интегрироваться в коллективы.",
                    mainDescription: """
                    Люди с 7 Арканом предпочитают работать в среде, где ценятся знания и глубокое понимание. Их аналитический ум и стремление к совершенству делают их ценными членами команды. Они привносят в коллектив интеллектуальную глубину и умение видеть перспективу.

                    Однако их склонность к критике и анализу иногда может создавать напряжение в общении. Для успешной социальной адаптации важно развивать навыки эмпатии и учиться находить общий язык с людьми, которые мыслят иначе.

                    Укрепляя свои коммуникативные навыки и проявляя гибкость, они смогут интегрироваться в любые коллективы и выстраивать гармоничные отношения с окружающими.
                    """
                ),
                Subcategory(
                    title: "Совместимость",
                    shortDescription: "Анализ с кем легче установить гармоничные и долгосрочные отношения.",
                    mainDescription: """
                    Люди с 7 Арканом лучше всего совместимы с партнёрами, которые ценят духовную глубину, интеллект и искренность. Они находят общий язык с теми, кто разделяет их стремление к самопознанию и духовному развитию.

                    Трудности могут возникнуть с людьми, которые склонны к поверхностным отношениям или избегают серьёзных разговоров. Для успешного союза важно находить баланс между своей склонностью к анализу и готовностью принимать партнёра таким, какой он есть.

                    Развивая способность к открытому общению и эмпатии, они смогут создать прочные и вдохновляющие отношения, основанные на взаимном уважении и духовной связи.
                    """
                )
            ]
        ),
        // MARK: - 8 Arkan
        8: ArkanInfo(
            title: "3. Отношения (8 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Романтические отношения",
                    shortDescription: "Перспективы в любви и браке, поиск гармонии в личной жизни.",
                    mainDescription: """
                    Ваше число в отношениях - 8 Аркан. Этот Аркан символизирует силу, ответственность и баланс в отношениях. Люди с этим числом судьбы стремятся к партнёрству, основанному на равенстве и взаимоуважении. Они обладают внутренней уверенностью, которая привлекает людей и создаёт основу для стабильных романтических связей.

                    В романтической сфере они проявляют заботу и готовы работать над отношениями, чтобы достичь гармонии. Однако их сильная натура иногда может вызывать желание доминировать, что приводит к дисбалансу. Для них важно помнить, что истинная сила заключается в умении сотрудничать.

                    Гармоничные отношения требуют умения уступать и делегировать ответственность. Это поможет создать партнёрство, основанное на любви, доверии и взаимной поддержке.
                    """
                ),
                Subcategory(
                    title: "Дружеские связи",
                    shortDescription: "Построение и укрепление дружеских отношений.",
                    mainDescription: """
                    Люди с 8 Арканом ценят друзей, которые разделяют их целеустремлённость и ответственность. Они готовы помогать близким и часто становятся опорой для своих друзей в трудные времена. Их надёжность делает их бесценными в дружбе.

                    Однако их склонность к серьёзности иногда может восприниматься как холодность или отстранённость. Для укрепления дружеских связей важно развивать лёгкость в общении и быть более открытым для спонтанности.

                    Уделяя внимание созданию баланса между серьёзностью и дружелюбием, они смогут построить глубокие и искренние дружеские отношения, которые будут наполнять их жизнь радостью.
                    """
                ),
                Subcategory(
                    title: "Семейные отношения",
                    shortDescription: "Взаимодействие с членами семьи и родственниками.",
                    mainDescription: """
                    В семейных отношениях люди с 8 Арканом часто берут на себя роль лидера, который обеспечивает стабильность и порядок. Они стремятся к справедливости и готовы приложить усилия, чтобы все члены семьи чувствовали себя комфортно и защищённо. Их способность брать на себя ответственность делает их надёжными и уважаемыми в кругу семьи.

                    Однако их стремление к контролю иногда может восприниматься как давление. Для гармоничных отношений важно учитывать мнение каждого члена семьи и находить компромиссы.

                    Создавая атмосферу доверия и открытости, они смогут укрепить семейные узы и создать обстановку, в которой каждый почувствует себя важным и любимым.
                    """
                ),
                Subcategory(
                    title: "Социальная адаптация",
                    shortDescription: "Умение общаться, налаживать контакты и интегрироваться в коллективы.",
                    mainDescription: """
                    Люди с 8 Арканом часто занимают лидерские позиции в социальных группах благодаря своему авторитету и умению принимать ответственные решения. Они уважают порядок и ценят коллег, которые разделяют их целеустремлённость и ответственность.

                    Однако их сильная воля иногда может восприниматься как жёсткость, что может мешать установлению гармоничных отношений. Для успешной социальной адаптации важно развивать эмпатию и способность воспринимать критику конструктивно.

                    Укрепляя свои коммуникативные навыки и проявляя гибкость, они смогут стать ценными членами любого коллектива, выстраивая уважительные и продуктивные отношения с окружающими.
                    """
                ),
                Subcategory(
                    title: "Совместимость",
                    shortDescription: "Анализ с кем легче установить гармоничные и долгосрочные отношения.",
                    mainDescription: """
                    Люди с 8 Арканом лучше всего совместимы с партнёрами, которые ценят силу, стабильность и ответственность. Они находят общий язык с теми, кто готов работать над отношениями и разделяет их стремление к порядку и гармонии.

                    Трудности могут возникнуть с партнёрами, которые избегают ответственности или склонны к хаотичности. Для успешного союза важно учиться быть более открытыми и проявлять терпимость к различным точкам зрения.

                    Развивая способность к компромиссу и укрепляя взаимное уважение, они смогут создать долгосрочные и гармоничные отношения, которые будут приносить радость и удовлетворение обеим сторонам.
                    """
                )
            ]
        ),
        // MARK: - 9 Arkan
        9: ArkanInfo(
            title: "3. Отношения (9 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Романтические отношения",
                    shortDescription: "Перспективы в любви и браке, поиск гармонии в личной жизни.",
                    mainDescription: """
                    Ваше число в отношениях - 9 Аркан. Этот Аркан символизирует мудрость, самоотдачу и глубину чувств. Люди с этим числом судьбы стремятся к отношениям, которые имеют высокий смысл и основаны на взаимной поддержке. Для них важна эмоциональная близость и духовное единство с партнёром.

                    В любви они проявляют искренность и заботу, готовность помогать своему партнёру и делиться с ним своей внутренней силой. Однако их склонность к самоотверженности иногда может приводить к тому, что они забывают о своих собственных потребностях.

                    Для гармонии в отношениях важно помнить о балансе между заботой о других и заботой о себе. Это поможет им создать прочный союз, наполненный теплом, доверием и уважением.
                    """
                ),
                Subcategory(
                    title: "Дружеские связи",
                    shortDescription: "Построение и укрепление дружеских отношений.",
                    mainDescription: """
                    Люди с 9 Арканом склонны к созданию глубоких и искренних дружеских связей. Они часто выступают в роли наставников и советчиков, готовых помочь своим друзьям в трудных ситуациях. Их мудрость и готовность выслушать делают их ценными друзьями.

                    Однако их склонность к уединению иногда мешает установлению новых дружеских связей. Для укрепления дружбы важно быть более открытым к новым знакомствам и проявлять инициативу в общении.

                    Уделяя время и внимание своим друзьям, они смогут создать круг близких людей, который будет поддерживать их в любых обстоятельствах.
                    """
                ),
                Subcategory(
                    title: "Семейные отношения",
                    shortDescription: "Взаимодействие с членами семьи и родственниками.",
                    mainDescription: """
                    В семейных отношениях люди с 9 Арканом часто играют роль мудрого наставника, который помогает своим близким находить решения в сложных ситуациях. Они обладают способностью глубоко понимать потребности других и предлагать полезные советы.

                    Однако их склонность к самоизоляции иногда может создавать дистанцию в отношениях с родственниками. Для укрепления семейных связей важно развивать привычку открыто делиться своими мыслями и чувствами.

                    Создавая атмосферу доверия и взаимопонимания, они смогут укрепить семейные узы и стать источником вдохновения для своих близких.
                    """
                ),
                Subcategory(
                    title: "Социальная адаптация",
                    shortDescription: "Умение общаться, налаживать контакты и интегрироваться в коллективы.",
                    mainDescription: """
                    Люди с 9 Арканом ценят гармонию и предпочитают работать в среде, где важны взаимное уважение и духовное развитие. Их мудрость и проницательность делают их ценными членами коллектива, способными находить компромиссы и вдохновлять окружающих.

                    Однако их склонность к уединению и независимости может затруднять установление социальных связей. Для успешной адаптации важно развивать навыки общения и учиться проявлять инициативу в новых коллективах.

                    Развивая свою способность к открытости и искреннему взаимодействию, они смогут успешно интегрироваться в любое сообщество и создать вокруг себя атмосферу доверия и поддержки.
                    """
                ),
                Subcategory(
                    title: "Совместимость",
                    shortDescription: "Анализ с кем легче установить гармоничные и долгосрочные отношения.",
                    mainDescription: """
                    Люди с 9 Арканом совместимы с теми, кто разделяет их стремление к глубоким и искренним отношениям. Они находят общий язык с партнёрами, которые ценят их мудрость, самоотдачу и духовность.

                    Трудности могут возникнуть с людьми, которые склонны к поверхностности или не готовы к эмоциональной глубине. Для успешного союза важно находить баланс между духовным единством и повседневными радостями.

                    Укрепляя свою способность к компромиссу и поддерживая эмоциональную близость, они смогут создать прочные отношения, которые будут приносить радость и гармонию обеим сторонам.
                    """
                )
            ]
        ),
        // MARK: - 10 Arkan
        10: ArkanInfo(
            title: "3. Отношения (10 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Романтические отношения",
                    shortDescription: "Перспективы в любви и браке, поиск гармонии в личной жизни.",
                    mainDescription: """
                    Ваше число в отношениях - 10 Аркан. Этот Аркан символизирует перемены, цикличность и адаптацию. Люди с этим числом судьбы в романтических отношениях часто испытывают как взлёты, так и падения. Их путь в любви не всегда прямолинеен, но каждое испытание укрепляет их дух и углубляет взаимопонимание с партнёром.

                    В любви они стремятся к свободе и динамике, предпочитая отношения, которые позволяют расти и развиваться. Они обладают способностью вдохновлять своего партнёра на перемены и находить радость в неожиданных ситуациях. Однако их склонность к переменчивости иногда может вызывать нестабильность.

                    Для гармонии в отношениях важно развивать способность к компромиссу и умение создавать эмоциональную устойчивость. Это поможет укрепить связь с партнёром и построить отношения, которые выдержат любые испытания.
                    """
                ),
                Subcategory(
                    title: "Дружеские связи",
                    shortDescription: "Построение и укрепление дружеских отношений.",
                    mainDescription: """
                    Люди с 10 Арканом обладают уникальной способностью привносить разнообразие и новизну в дружеские отношения. Их энергичность и любовь к переменам делают их интересными собеседниками и вдохновителями в кругу друзей. Они часто инициируют яркие события и мотивируют окружающих на новые свершения.

                    Однако их переменчивый характер может приводить к разрыву связей, если они не проявляют стабильности в дружбе. Для укрепления дружеских отношений важно уделять внимание постоянству и быть готовыми поддерживать друзей в трудные моменты.

                    Создавая баланс между своей динамичностью и надёжностью, они смогут построить прочные и вдохновляющие дружеские связи.
                    """
                ),
                Subcategory(
                    title: "Семейные отношения",
                    shortDescription: "Взаимодействие с членами семьи и родственниками.",
                    mainDescription: """
                    В семейных отношениях люди с 10 Арканом привносят дух перемен и обновления. Они часто становятся инициаторами новых традиций и стремятся к созданию атмосферы, которая способствует росту и развитию каждого члена семьи. Их гибкость и способность адаптироваться помогают справляться с семейными трудностями.

                    Однако их любовь к переменам иногда может вызывать недоумение или напряжение у более стабильных членов семьи. Для гармоничных отношений важно учиться учитывать мнение других и создавать основу, которая дарит чувство стабильности.

                    Развивая открытое общение и уважение к потребностям близких, они смогут укрепить семейные узы и создать обстановку, где каждый почувствует себя важным и ценным.
                    """
                ),
                Subcategory(
                    title: "Социальная адаптация",
                    shortDescription: "Умение общаться, налаживать контакты и интегрироваться в коллективы.",
                    mainDescription: """
                    Люди с 10 Арканом легко адаптируются к изменениям и находят общий язык с самыми разными людьми. Их гибкость и умение принимать новые обстоятельства делают их незаменимыми в коллективе. Они часто становятся связующим звеном, помогая другим справляться с переменами и видеть в них возможности для роста.

                    Однако их склонность к постоянным переменам может затруднять создание долгосрочных социальных связей. Для успешной социальной адаптации важно развивать терпение и способность уделять внимание потребностям окружающих.

                    Сохраняя свою способность к адаптации и проявляя больше стабильности в общении, они смогут укрепить свои социальные связи и выстроить гармоничные отношения с окружающими.
                    """
                ),
                Subcategory(
                    title: "Совместимость",
                    shortDescription: "Анализ с кем легче установить гармоничные и долгосрочные отношения.",
                    mainDescription: """
                    Люди с 10 Арканом совместимы с теми, кто ценит динамику, гибкость и готовность к переменам. Они находят общий язык с партнёрами, которые готовы расти и развиваться вместе с ними, не боясь трудностей и изменений.

                    Трудности могут возникнуть с людьми, которые склонны к рутине или избегают новшеств. Для успешного союза важно находить баланс между своей любовью к свободе и потребностью партнёра в стабильности.

                    Укрепляя способность к компромиссу и поддерживая взаимное уважение, они смогут построить отношения, которые будут вдохновлять и развивать обоих партнёров.
                    """
                )
            ]
        ),
        // MARK: - 11 Arkan
        11: ArkanInfo(
            title: "3. Отношения (11 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Романтические отношения",
                    shortDescription: "Перспективы в любви и браке, поиск гармонии в личной жизни.",
                    mainDescription: """
                    Ваше число в отношениях - 11 Аркан. Этот Аркан символизирует внутреннюю силу, страсть и баланс в отношениях. Люди с этим числом судьбы часто ищут в любви не только эмоциональную связь, но и партнёра, который разделяет их энергичность и стремление к росту. Они обладают ярко выраженной харизмой, что делает их привлекательными в глазах других.

                    В романтической сфере они склонны проявлять инициативу и брать на себя ответственность за развитие отношений. Их внутренняя сила помогает преодолевать трудности и вдохновлять партнёра на свершения. Однако их стремление к доминированию может иногда вызывать напряжение.

                    Для гармонии в отношениях важно помнить о балансе между своей силой и уважением к индивидуальности партнёра. Развивая терпимость и умение слушать, они смогут создать прочный союз, основанный на взаимной любви и уважении.
                    """
                ),
                Subcategory(
                    title: "Дружеские связи",
                    shortDescription: "Построение и укрепление дружеских отношений.",
                    mainDescription: """
                    Люди с 11 Арканом привлекают друзей своей энергией и вдохновением. Они становятся источником мотивации и поддержки для своего окружения, часто помогая друзьям справляться с трудностями. Их уверенность и решительность делают их надёжными и верными друзьями.

                    Однако их сильная натура иногда может быть воспринимаема как доминирующая, что может вызывать напряжение в дружеских отношениях. Для укрепления дружбы важно учиться проявлять больше мягкости и уделять внимание потребностям других.

                    Создавая баланс между своей силой и заботой о друзьях, они смогут построить дружеские отношения, которые будут наполнены доверием и взаимным уважением.
                    """
                ),
                Subcategory(
                    title: "Семейные отношения",
                    shortDescription: "Взаимодействие с членами семьи и родственниками.",
                    mainDescription: """
                    В семейных отношениях люди с 11 Арканом часто становятся лидерами, которые вдохновляют своих близких и направляют их к достижению целей. Они обладают способностью создавать атмосферу уверенности и стабильности, что помогает семье преодолевать любые трудности.

                    Однако их склонность к контролю может вызывать недоразумения, особенно если они не учитывают мнения других членов семьи. Для гармоничных отношений важно развивать способность слушать и учитывать потребности каждого.

                    Укрепляя взаимное уважение и развивая умение делегировать ответственность, они смогут создать в семье атмосферу доверия и поддержки, где каждый чувствует себя значимым.
                    """
                ),
                Subcategory(
                    title: "Социальная адаптация",
                    shortDescription: "Умение общаться, налаживать контакты и интегрироваться в коллективы.",
                    mainDescription: """
                    Люди с 11 Арканом обладают природным лидерством, что помогает им находить своё место в любом коллективе. Их уверенность и умение вдохновлять окружающих делают их центральной фигурой в социальной группе. Они способны принимать ответственные решения и находить пути для преодоления сложностей.

                    Однако их сильное желание контролировать ситуацию иногда может вызывать сопротивление со стороны окружающих. Для успешной социальной адаптации важно развивать эмпатию и быть более открытыми к мнениям других.

                    Укрепляя свои навыки общения и проявляя гибкость, они смогут интегрироваться в любые коллективы и выстраивать гармоничные отношения с окружающими.
                    """
                ),
                Subcategory(
                    title: "Совместимость",
                    shortDescription: "Анализ с кем легче установить гармоничные и долгосрочные отношения.",
                    mainDescription: """
                    Люди с 11 Арканом совместимы с партнёрами, которые ценят их силу, целеустремлённость и желание развиваться. Они находят общий язык с теми, кто разделяет их стремление к успеху и готов поддерживать их в сложные моменты.

                    Трудности могут возникнуть с людьми, которые не готовы к интенсивным и энергичным отношениям. Для успешного союза важно учиться проявлять мягкость и учитывать эмоциональные потребности партнёра.

                    Развивая способность к компромиссу и укрепляя взаимное доверие, они смогут создать долгосрочные отношения, которые будут наполнены вдохновением и гармонией.
                    """
                )
            ]
        ),
        // MARK: - 12 Arkan
        12: ArkanInfo(
            title: "3. Отношения (12 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Романтические отношения",
                    shortDescription: "Перспективы в любви и браке, поиск гармонии в личной жизни.",
                    mainDescription: """
                    Ваше число в отношениях - 12 Аркан. Этот Аркан символизирует терпение, принятие и готовность к жертвам ради любви. Люди с этим числом судьбы стремятся к глубоким и значимым отношениям, в которых оба партнёра готовы работать над достижением гармонии и взаимопонимания. Они воспринимают любовь как процесс, требующий усилий и самоотдачи.

                    В романтических отношениях они проявляют преданность и заботу, часто ставя потребности партнёра выше своих. Это делает их надёжными и искренними партнёрами. Однако их склонность к самоотречению может приводить к потере баланса в отношениях.

                    Для гармонии важно помнить о своих потребностях и развивать способность к открытому общению. Это поможет избежать эмоционального выгорания и создать союз, который принесёт счастье обеим сторонам.
                    """
                ),
                Subcategory(
                    title: "Дружеские связи",
                    shortDescription: "Построение и укрепление дружеских отношений.",
                    mainDescription: """
                    Люди с 12 Арканом проявляют в дружбе терпение и готовность поддерживать своих друзей в любых обстоятельствах. Они обладают умением слушать и понимать, что делает их надёжными и ценными друзьями. Их стремление к гармонии помогает сглаживать конфликты и укреплять дружеские узы.

                    Однако их склонность к жертвенности иногда может приводить к тому, что они чувствуют себя недооценёнными. Для крепкой дружбы важно развивать умение устанавливать границы и помнить о своих потребностях.

                    Укрепляя баланс между помощью другим и заботой о себе, они смогут создать дружеские отношения, которые будут приносить радость и поддержку обеим сторонам.
                    """
                ),
                Subcategory(
                    title: "Семейные отношения",
                    shortDescription: "Взаимодействие с членами семьи и родственниками.",
                    mainDescription: """
                    В семейных отношениях люди с 12 Арканом проявляют терпение, мудрость и готовность помогать своим близким. Они стремятся создать атмосферу взаимопонимания и поддержки, часто выступая в роли миротворцев. Их умение жертвовать ради блага семьи делает их опорой для своих близких.

                    Однако их склонность к самоотречению иногда может вызывать чувство усталости или неудовлетворённости. Для гармоничных семейных отношений важно научиться делегировать обязанности и открыто выражать свои чувства.

                    Создавая равновесие между заботой о других и уважением к собственным потребностям, они смогут укрепить семейные узы и создать обстановку, в которой все члены семьи будут чувствовать себя счастливыми.
                    """
                ),
                Subcategory(
                    title: "Социальная адаптация",
                    shortDescription: "Умение общаться, налаживать контакты и интегрироваться в коллективы.",
                    mainDescription: """
                    Люди с 12 Арканом обладают способностью к глубокому пониманию окружающих, что помогает им налаживать контакты и находить общий язык даже с разными людьми. Их терпимость и желание помочь делают их ценными членами коллектива.

                    Однако их склонность к самоотречению иногда может приводить к тому, что они берут на себя слишком много обязанностей, что вызывает стресс и переутомление. Для успешной социальной адаптации важно учиться делегировать задачи и говорить "нет", когда это необходимо.

                    Развивая навыки самоподдержки и учась сохранять баланс, они смогут интегрироваться в любые коллективы, оставаясь эффективными и гармоничными участниками группы.
                    """
                ),
                Subcategory(
                    title: "Совместимость",
                    shortDescription: "Анализ с кем легче установить гармоничные и долгосрочные отношения.",
                    mainDescription: """
                    Люди с 12 Арканом лучше всего совместимы с партнёрами, которые ценят терпение, глубину и готовность к работе над отношениями. Они находят общий язык с теми, кто готов делиться своими чувствами и совместно преодолевать жизненные трудности.

                    Трудности могут возникнуть с людьми, которые избегают обязательств или склонны к эгоизму. Для успешного союза важно развивать открытость и уверенность в выражении своих потребностей.

                    Укрепляя способность к равноправию в отношениях, они смогут создать долгосрочные союзы, наполненные доверием, уважением и любовью.
                    """
                )
            ]
        ),
        // MARK: - 13 Arkan
        13: ArkanInfo(
            title: "3. Отношения (13 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Романтические отношения",
                    shortDescription: "Перспективы в любви и браке, поиск гармонии в личной жизни.",
                    mainDescription: """
                    Ваше число в отношениях - 13 Аркан. Этот Аркан символизирует трансформацию, обновление и принятие перемен. В романтических отношениях люди с этим числом судьбы часто проходят через этапы глубоких изменений. Они видят любовь как возможность роста и возрождения, готовясь отпускать старое и принимать новое, чтобы создать гармоничный союз.

                    Их способность к эмоциональной трансформации делает их партнёрами, способными адаптироваться к изменяющимся обстоятельствам. Они ценят искренность и глубину, стремясь к отношениям, которые поддерживают их развитие. Однако их склонность к периодам эмоционального уединения может вызывать у партнёра ощущение дистанции.

                    Для гармонии в отношениях важно делиться своими чувствами и поддерживать открытый диалог с партнёром. Это поможет создать устойчивый союз, который выдержит любые изменения и принесёт обоим чувство внутреннего удовлетворения.
                    """
                ),
                Subcategory(
                    title: "Дружеские связи",
                    shortDescription: "Построение и укрепление дружеских отношений.",
                    mainDescription: """
                    Люди с 13 Арканом привлекают друзей своей способностью видеть суть вещей и помогать другим справляться с изменениями. Они становятся поддержкой для тех, кто ищет понимание и руководство в трудные времена. Их глубокое восприятие жизни делает их ценными друзьями, которые способны вдохновлять на перемены.

                    Однако их склонность к периодам изоляции иногда может создавать барьеры в дружбе. Для укрепления дружеских связей важно оставаться открытым к общению и уделять внимание поддержанию контактов.

                    Уделяя время друзьям и проявляя инициативу, они смогут построить отношения, наполненные доверием и взаимной поддержкой, которые будут вдохновлять обе стороны на развитие.
                    """
                ),
                Subcategory(
                    title: "Семейные отношения",
                    shortDescription: "Взаимодействие с членами семьи и родственниками.",
                    mainDescription: """
                    В семейных отношениях люди с 13 Арканом часто становятся инициаторами перемен, которые помогают семье расти и развиваться. Их способность принимать трудности и трансформировать их в возможности делает их важным источником вдохновения для близких. Они помогают членам семьи преодолевать кризисы и находить новые пути решения проблем.

                    Однако их склонность к уединению и внутренним размышлениям иногда может вызывать ощущение отчуждения у родственников. Для гармоничных семейных отношений важно делиться своими мыслями и поддерживать активное участие в семейной жизни.

                    Создавая баланс между своим внутренним миром и общением с близкими, они смогут укрепить семейные узы и стать важной опорой для своей семьи.
                    """
                ),
                Subcategory(
                    title: "Социальная адаптация",
                    shortDescription: "Умение общаться, налаживать контакты и интегрироваться в коллективы.",
                    mainDescription: """
                    Люди с 13 Арканом обладают способностью видеть скрытые возможности в любых обстоятельствах, что делает их ценными членами коллектива. Они привносят в коллектив идеи обновления и трансформации, вдохновляя окружающих на принятие перемен. Их интуиция и способность адаптироваться помогают справляться с любыми вызовами.

                    Однако их склонность к самостоятельной работе иногда может затруднять социальное взаимодействие. Для успешной социальной адаптации важно развивать навыки командной работы и быть открытым для совместного обсуждения идей.

                    Проявляя инициативу и уделяя внимание коллективным интересам, они смогут выстроить гармоничные отношения в рабочей среде и стать примером для других.
                    """
                ),
                Subcategory(
                    title: "Совместимость",
                    shortDescription: "Анализ с кем легче установить гармоничные и долгосрочные отношения.",
                    mainDescription: """
                    Люди с 13 Арканом совместимы с теми, кто готов к переменам и разделяет их стремление к развитию. Они находят общий язык с партнёрами, которые понимают важность трансформаций и способны поддерживать их в моменты изменений.

                    Трудности могут возникнуть с теми, кто избегает перемен или стремится к полной стабильности. Для успешного союза важно находить баланс между своей склонностью к обновлению и потребностью партнёра в уверенности.

                    Укрепляя взаимопонимание и поддерживая эмоциональную близость, они смогут создать отношения, которые будут вдохновлять на совместное развитие и приносить радость обоим.
                    """
                )
            ]
        ),
        // MARK: - 14 Arkan
        14: ArkanInfo(
            title: "3. Отношения (14 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Романтические отношения",
                    shortDescription: "Перспективы в любви и браке, поиск гармонии в личной жизни.",
                    mainDescription: """
                    Ваше число в отношениях - 14 Аркан. Этот Аркан символизирует баланс, гармонию и умение находить золотую середину. Люди с этим числом судьбы стремятся к романтическим отношениям, где царит взаимопонимание, уважение и поддержка. Они обладают способностью сглаживать конфликты и находить компромиссы, что делает их ценными партнёрами.

                    В любви они ищут партнёра, который разделяет их стремление к гармонии. Их природная мягкость и терпимость помогают строить отношения, которые наполнены теплотой и доверием. Однако иногда их стремление избегать конфликтов может приводить к подавлению собственных желаний.

                    Для гармонии в отношениях важно учиться выражать свои чувства и потребности. Это позволит сохранить баланс между заботой о партнёре и уважением к своим собственным желаниям, создавая устойчивый и счастливый союз.
                    """
                ),
                Subcategory(
                    title: "Дружеские связи",
                    shortDescription: "Построение и укрепление дружеских отношений.",
                    mainDescription: """
                    Люди с 14 Арканом являются природными миротворцами в дружбе. Они умеют создавать атмосферу доверия и комфорта, что делает их надёжными друзьями. Их способность видеть разные точки зрения помогает им налаживать дружеские связи и разрешать конфликты.

                    Однако их стремление угодить всем иногда может приводить к недостаточной чёткости в выражении своих границ. Для укрепления дружеских связей важно быть более открытыми и искренними в своих ожиданиях.

                    Развивая способность честно выражать свои мысли, они смогут создать дружбу, которая будет вдохновлять и поддерживать обе стороны на протяжении всей жизни.
                    """
                ),
                Subcategory(
                    title: "Семейные отношения",
                    shortDescription: "Взаимодействие с членами семьи и родственниками.",
                    mainDescription: """
                    В семейных отношениях люди с 14 Арканом стремятся поддерживать гармонию и стабильность. Они готовы идти на компромиссы, чтобы создать атмосферу любви и взаимопонимания в кругу семьи. Их умение уравновешивать разные интересы помогает избежать конфликтов и укрепить семейные узы.

                    Однако их стремление избегать острых тем иногда может препятствовать решению важных вопросов. Для гармоничных отношений важно учиться обсуждать сложные моменты и выражать свои истинные чувства.

                    Создавая пространство для честного общения и взаимного уважения, они смогут построить семью, где каждый чувствует себя услышанным и любимым.
                    """
                ),
                Subcategory(
                    title: "Социальная адаптация",
                    shortDescription: "Умение общаться, налаживать контакты и интегрироваться в коллективы.",
                    mainDescription: """
                    Люди с 14 Арканом обладают природной способностью создавать гармоничные отношения в коллективе. Их терпимость и умение находить компромиссы делают их ценными членами любой группы. Они умеют работать с разными типами людей, находя подход к каждому.

                    Однако их стремление избегать конфликтов иногда может мешать им выражать свои собственные идеи. Для успешной социальной адаптации важно развивать уверенность в себе и готовность отстаивать свои позиции.

                    Используя свои дипломатические способности и одновременно проявляя решительность, они смогут стать лидерами, которые вдохновляют и объединяют окружающих.
                    """
                ),
                Subcategory(
                    title: "Совместимость",
                    shortDescription: "Анализ с кем легче установить гармоничные и долгосрочные отношения.",
                    mainDescription: """
                    Люди с 14 Арканом совместимы с партнёрами, которые ценят гармонию, терпимость и баланс. Они находят общий язык с теми, кто готов работать над отношениями и стремится к равновесию в жизни.

                    Трудности могут возникнуть с людьми, которые склонны к чрезмерной эмоциональности или конфликтам. Для успешного союза важно учиться справляться с трудностями и совместно искать решения.

                    Развивая способность к открытости и взаимному уважению, они смогут создать отношения, которые будут приносить радость и удовлетворение обеим сторонам.
                    """
                )
            ]
        ),
        // MARK: - 15 Arkan
        15: ArkanInfo(
            title: "3. Отношения (15 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Романтические отношения",
                    shortDescription: "Перспективы в любви и браке, поиск гармонии в личной жизни.",
                    mainDescription: """
                    Ваше число в отношениях - 15 Аркан. Этот Аркан символизирует страсть, искушение и интенсивные эмоциональные связи. Люди с этим числом судьбы часто привлекают партнёров своей харизмой и энергией, создавая вокруг себя атмосферу магнетизма. Их отношения обычно наполнены эмоциями, которые могут варьироваться от восторга до сложных испытаний.

                    В любви они стремятся к глубоким, чувственным связям, однако их склонность к сильным эмоциям иногда приводит к драматическим ситуациям. Они могут быть собственниками или ожидать от партнёра полного подчинения, что вызывает напряжение.

                    Для гармонии важно учиться управлять своими эмоциями и избегать манипуляций. Построение доверительных отношений, основанных на уважении и равенстве, поможет создать устойчивый и счастливый союз, в котором будет место для страсти и гармонии.
                    """
                ),
                Subcategory(
                    title: "Дружеские связи",
                    shortDescription: "Построение и укрепление дружеских отношений.",
                    mainDescription: """
                    Люди с 15 Арканом обладают сильным влиянием на своих друзей. Их энергия, харизма и смелость привлекают людей, которые ищут вдохновения и поддержки. Они могут быть инициаторами ярких и запоминающихся событий, которые укрепляют дружеские связи.

                    Однако их сильный характер иногда может проявляться в виде доминирования или чрезмерного контроля, что может вызывать напряжение в дружбе. Для укрепления дружеских отношений важно учиться быть более гибкими и учитывать потребности других.

                    Уделяя внимание взаимному уважению и открытости, они смогут создать дружеские связи, которые будут вдохновлять и поддерживать обе стороны на протяжении всей жизни.
                    """
                ),
                Subcategory(
                    title: "Семейные отношения",
                    shortDescription: "Взаимодействие с членами семьи и родственниками.",
                    mainDescription: """
                    В семейных отношениях люди с 15 Арканом часто становятся центральной фигурой, которая влияет на общую динамику. Они привносят в семью страсть и энергию, которая может вдохновлять других на действия и перемены. Их сила и уверенность в себе помогают справляться с трудными ситуациями.

                    Однако их склонность к контролю и иногда к манипуляциям может вызывать напряжение среди близких. Для гармонии важно развивать терпимость и учиться учитывать мнение других членов семьи.

                    Создавая атмосферу доверия и взаимопонимания, они смогут укрепить семейные узы и стать источником вдохновения и поддержки для своих близких.
                    """
                ),
                Subcategory(
                    title: "Социальная адаптация",
                    shortDescription: "Умение общаться, налаживать контакты и интегрироваться в коллективы.",
                    mainDescription: """
                    Люди с 15 Арканом обладают природной способностью привлекать внимание и устанавливать контакты. Их харизма и уверенность делают их заметными фигурами в любом коллективе. Они часто становятся лидерами, которые вдохновляют других на действие и помогают справляться с трудностями.

                    Однако их склонность к доминированию или чрезмерному контролю может создавать барьеры в общении. Для успешной социальной адаптации важно развивать эмпатию и учиться слушать окружающих.

                    Проявляя уважение и гибкость, они смогут создать прочные социальные связи и стать ценным участником любого коллектива.
                    """
                ),
                Subcategory(
                    title: "Совместимость",
                    shortDescription: "Анализ с кем легче установить гармоничные и долгосрочные отношения.",
                    mainDescription: """
                    Люди с 15 Арканом совместимы с партнёрами, которые ценят страсть, эмоциональную глубину и силу характера. Они находят общий язык с теми, кто готов принимать их интенсивные эмоции и делиться своими чувствами.

                    Трудности могут возникнуть с людьми, которые стремятся к полной независимости или не готовы к глубоким эмоциональным связям. Для успешного союза важно работать над балансом между свободой и привязанностью.

                    Укрепляя взаимопонимание и учась управлять своими эмоциями, они смогут создать отношения, которые будут наполнены страстью и гармонией, вдохновляя обе стороны на развитие.
                    """
                )
            ]
        ),
        // MARK: - 16 Arkan
        16: ArkanInfo(
            title: "3. Отношения (16 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Романтические отношения",
                    shortDescription: "Перспективы в любви и браке, поиск гармонии в личной жизни.",
                    mainDescription: """
                    Ваше число в отношениях - 16 Аркан. Этот Аркан символизирует разрушение старого и освобождение от ненужного. Люди с этим числом судьбы в романтических отношениях часто сталкиваются с ситуациями, которые требуют глубоких изменений. Их путь в любви связан с преодолением трудностей и принятием перемен, которые ведут к более гармоничным союзам.

                    В любви они ищут партнёра, который готов разделить их стремление к трансформации. Их интенсивность и честность делают их искренними партнёрами, которые не боятся обсуждать сложные темы. Однако их склонность к резким переменам иногда может вызывать у партнёра чувство нестабильности.

                    Для гармонии в отношениях важно научиться мягко вводить изменения и делиться своими намерениями. Это поможет создать доверие и стабильность, даже в период перемен, и укрепить союз, который выдержит любые испытания.
                    """
                ),
                Subcategory(
                    title: "Дружеские связи",
                    shortDescription: "Построение и укрепление дружеских отношений.",
                    mainDescription: """
                    Люди с 16 Арканом привлекают друзей своей прямотой и способностью помогать другим преодолевать кризисы. Они становятся поддержкой в трудные времена, помогая окружающим освободиться от ненужного и начать новую главу в своей жизни. Их умение видеть корень проблемы делает их ценными друзьями.

                    Однако их склонность к резким действиям и прямолинейности может иногда вызывать недоразумения. Для укрепления дружбы важно учиться быть более тактичными и учитывать чувства других.

                    Создавая баланс между своей честностью и мягкостью, они смогут построить дружеские отношения, которые будут основаны на доверии и взаимопонимании.
                    """
                ),
                Subcategory(
                    title: "Семейные отношения",
                    shortDescription: "Взаимодействие с членами семьи и родственниками.",
                    mainDescription: """
                    В семейных отношениях люди с 16 Арканом часто играют роль преобразователей, которые помогают семье пересмотреть устоявшиеся модели поведения и избавиться от негативных привычек. Они стремятся к созданию более здоровой и гармоничной семейной атмосферы.

                    Однако их склонность к критике или резким изменениям может вызывать напряжение среди членов семьи. Для гармонии важно находить подходящие моменты для перемен и объяснять свои намерения близким.

                    Развивая терпение и умение слушать, они смогут укрепить семейные узы и стать источником вдохновения для своих близких, помогая им расти и развиваться.
                    """
                ),
                Subcategory(
                    title: "Социальная адаптация",
                    shortDescription: "Умение общаться, налаживать контакты и интегрироваться в коллективы.",
                    mainDescription: """
                    Люди с 16 Арканом обладают способностью видеть скрытые проблемы в коллективе и предлагать решения, которые ведут к улучшению общей атмосферы. Их честность и стремление к истине делают их ценными участниками команды, которые могут вдохновлять других на перемены.

                    Однако их прямолинейность и склонность к критике иногда могут вызывать сопротивление со стороны коллег. Для успешной социальной адаптации важно развивать навыки дипломатии и учиться мягко доносить свои идеи.

                    Проявляя больше гибкости и эмпатии, они смогут интегрироваться в коллектив и стать лидерами, которые вдохновляют на позитивные изменения.
                    """
                ),
                Subcategory(
                    title: "Совместимость",
                    shortDescription: "Анализ с кем легче установить гармоничные и долгосрочные отношения.",
                    mainDescription: """
                    Люди с 16 Арканом совместимы с партнёрами, которые готовы к изменениям и разделяют их стремление к личностному росту. Они находят общий язык с теми, кто ценит честность и готовность работать над отношениями.

                    Трудности могут возникнуть с людьми, которые боятся перемен или избегают глубоких обсуждений. Для успешного союза важно учиться находить баланс между стремлением к трансформации и сохранением стабильности.

                    Укрепляя взаимопонимание и работая над доверием, они смогут создать отношения, которые будут наполнены искренностью, ростом и гармонией.
                    """
                )
            ]
        ),
        // MARK: - 17 Arkan
        17: ArkanInfo(
            title: "3. Отношения (17 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Романтические отношения",
                    shortDescription: "Перспективы в любви и браке, поиск гармонии в личной жизни.",
                    mainDescription: """
                    Ваше число в отношениях - 17 Аркан. Этот Аркан символизирует надежду, вдохновение и стремление к гармонии. Люди с этим числом судьбы в романтической сфере часто выступают источником света и поддержки для своих партнёров. Их любовь проникнута оптимизмом и верой в лучшее, что помогает справляться с трудностями и укрепляет отношения.

                    Они ищут партнёра, который разделяет их мечты и устремления. В отношениях они проявляют заботу, чуткость и искреннюю поддержку. Однако их идеалистичный взгляд на любовь иногда может приводить к завышенным ожиданиям, которые сложно удовлетворить.

                    Для гармонии в отношениях важно сохранять реалистичный взгляд на партнёра и учиться принимать его таким, какой он есть. Это поможет создать крепкий союз, наполненный вдохновением и взаимным уважением.
                    """
                ),
                Subcategory(
                    title: "Дружеские связи",
                    shortDescription: "Построение и укрепление дружеских отношений.",
                    mainDescription: """
                    Люди с 17 Арканом являются вдохновляющими и верными друзьями. Они обладают способностью поддерживать своих друзей в сложные моменты, внушая им уверенность в себе и даря ощущение надежды. Их оптимизм и творческое мышление делают их незаменимыми в дружеских отношениях.

                    Однако их стремление видеть только лучшее иногда может мешать им замечать реальные проблемы в отношениях. Для укрепления дружбы важно учиться быть более внимательными к потребностям друзей и проявлять терпимость к их недостаткам.

                    Развивая честность и эмпатию, они смогут создать дружеские связи, которые будут наполнять радостью и вдохновением обе стороны.
                    """
                ),
                Subcategory(
                    title: "Семейные отношения",
                    shortDescription: "Взаимодействие с членами семьи и родственниками.",
                    mainDescription: """
                    В семейных отношениях люди с 17 Арканом привносят свет и оптимизм. Они стремятся поддерживать своих близких, вдохновлять их на достижение целей и помогать справляться с трудностями. Их способность видеть позитивное в любой ситуации делает их источником надежды и мотивации для семьи.

                    Однако их склонность избегать конфликтов может иногда мешать решению сложных вопросов. Для гармоничных отношений важно научиться открыто обсуждать проблемы и принимать участие в совместном поиске решений.

                    Укрепляя взаимопонимание и проявляя активное участие в жизни семьи, они смогут создать атмосферу тепла, любви и поддержки.
                    """
                ),
                Subcategory(
                    title: "Социальная адаптация",
                    shortDescription: "Умение общаться, налаживать контакты и интегрироваться в коллективы.",
                    mainDescription: """
                    Люди с 17 Арканом обладают природной способностью вдохновлять и объединять людей. Их оптимизм и доброжелательность помогают им легко находить общий язык с окружающими. Они часто становятся центром внимания в коллективе, привнося в него атмосферу позитива и творчества.

                    Однако их идеализм иногда может мешать им справляться с реалиями социальных взаимодействий. Для успешной социальной адаптации важно развивать прагматичность и умение работать с разными типами людей.

                    Проявляя гибкость и сохраняющуюся доброжелательность, они смогут выстраивать прочные социальные связи, которые будут поддерживать их в профессиональной и личной жизни.
                    """
                ),
                Subcategory(
                    title: "Совместимость",
                    shortDescription: "Анализ с кем легче установить гармоничные и долгосрочные отношения.",
                    mainDescription: """
                    Люди с 17 Арканом совместимы с партнёрами, которые ценят их оптимизм, чуткость и стремление к гармонии. Они находят общий язык с теми, кто готов делиться своими мечтами и поддерживать их в сложные моменты.

                    Трудности могут возникнуть с людьми, которые склонны к пессимизму или избегают ответственности. Для успешного союза важно находить баланс между своими ожиданиями и реальными возможностями партнёра.

                    Развивая терпимость и умение принимать несовершенства, они смогут создать отношения, которые будут вдохновлять обе стороны и наполнять их жизнь радостью и светом.
                    """
                )
            ]
        ),
        // MARK: - 18 Arkan
        18: ArkanInfo(
            title: "3. Отношения (18 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Романтические отношения",
                    shortDescription: "Перспективы в любви и браке, поиск гармонии в личной жизни.",
                    mainDescription: """
                    Ваше число в отношениях - 18 Аркан. Этот Аркан символизирует глубину чувств, тайны и интуицию. В романтических отношениях люди с этим числом судьбы обладают высокой эмоциональностью и тонкой интуицией. Они часто чувствуют настроение партнёра и стремятся создать атмосферу доверия и близости.

                    Однако их склонность к переживаниям и скрытности может вызывать недоразумения в отношениях. Они могут бояться открыто выражать свои чувства, что иногда приводит к недопониманию. Партнёры таких людей должны быть готовы к тому, что понадобится время для полного раскрытия их эмоций.

                    Для гармонии в отношениях важно развивать уверенность в себе и открытость. Доверительный диалог и поддержка помогут создать устойчивую связь, которая выдержит любые испытания, делая отношения более глубокими и значимыми.
                    """
                ),
                Subcategory(
                    title: "Дружеские связи",
                    shortDescription: "Построение и укрепление дружеских отношений.",
                    mainDescription: """
                    Люди с 18 Арканом привлекают друзей своей чуткостью и способностью поддерживать в трудные моменты. Их глубокая интуиция помогает им понимать чувства и мысли друзей, даже если те их не выражают. Они могут стать верными друзьями, которые всегда готовы выслушать и дать мудрый совет.

                    Однако их склонность к излишним переживаниям и анализу иногда может мешать им расслабиться в дружеских отношениях. Для укрепления дружбы важно учиться не только давать, но и принимать поддержку от других.

                    Укрепляя баланс в отношениях и развивая открытость, они смогут создать дружбу, которая будет основана на взаимопонимании и доверии.
                    """
                ),
                Subcategory(
                    title: "Семейные отношения",
                    shortDescription: "Взаимодействие с членами семьи и родственниками.",
                    mainDescription: """
                    В семейных отношениях люди с 18 Арканом стремятся к эмоциональной близости и гармонии. Они чувствительны к потребностям своих близких и часто становятся теми, к кому обращаются за поддержкой. Их способность видеть суть проблем помогает находить решения, которые укрепляют семью.

                    Однако их склонность к скрытности и изоляции иногда может вызывать недоразумения среди членов семьи. Для создания гармоничных отношений важно открыто говорить о своих чувствах и быть готовым обсуждать сложные темы.

                    Развивая способность делиться своими эмоциями и укрепляя доверие, они смогут создать семью, где каждый чувствует себя услышанным и поддержанным.
                    """
                ),
                Subcategory(
                    title: "Социальная адаптация",
                    shortDescription: "Умение общаться, налаживать контакты и интегрироваться в коллективы.",
                    mainDescription: """
                    Люди с 18 Арканом обладают способностью чувствовать настроение окружающих, что помогает им находить общий язык даже с самыми сложными личностями. Их эмпатия и интуиция делают их ценными участниками любого коллектива. Они могут видеть скрытые проблемы и предлагать решения, которые улучшают общую атмосферу.

                    Однако их склонность к самоанализу и переживаниям может мешать им полностью раскрыть свой потенциал в социальной среде. Для успешной адаптации важно развивать уверенность в своих силах и открытость в общении.

                    Укрепляя свои социальные навыки и проявляя инициативу, они смогут построить прочные связи, которые принесут пользу как им самим, так и их окружению.
                    """
                ),
                Subcategory(
                    title: "Совместимость",
                    shortDescription: "Анализ с кем легче установить гармоничные и долгосрочные отношения.",
                    mainDescription: """
                    Люди с 18 Арканом совместимы с партнёрами, которые ценят глубину чувств, эмоциональную близость и искренность. Они находят общий язык с теми, кто готов разделить их мечты и поддерживать в моменты сомнений.

                    Трудности могут возникнуть с людьми, которые не привыкли к сильной эмоциональности или избегают обсуждения глубоких тем. Для успешного союза важно работать над открытостью и совместным принятием решений.

                    Укрепляя доверие и взаимопонимание, они смогут создать отношения, которые будут наполнены теплом, любовью и искренностью, принося счастье обеим сторонам.
                    """
                )
            ]
        ),
        // MARK: - 19 Arkan
        19: ArkanInfo(
            title: "3. Отношения (19 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Романтические отношения",
                    shortDescription: "Перспективы в любви и браке, поиск гармонии в личной жизни.",
                    mainDescription: """
                    Ваше число в отношениях - 19 Аркан. Этот Аркан символизирует радость, свет и открытость. Люди с этим числом судьбы в романтических отношениях излучают тепло и уверенность, создавая вокруг себя атмосферу счастья и гармонии. Они привлекают партнёров своим позитивным настроем и умением находить радость даже в мелочах.

                    В любви они искренни и щедры, готовы делиться своими чувствами и поддерживать партнёра. Их открытость и энтузиазм делают их вдохновляющими партнёрами, однако иногда их потребность в постоянном внимании может создавать напряжение.

                    Для гармонии в отношениях важно учиться быть более терпеливыми и уделять внимание эмоциональным потребностям партнёра. Развивая баланс между своим оптимизмом и чуткостью, они смогут построить крепкие и счастливые отношения.
                    """
                ),
                Subcategory(
                    title: "Дружеские связи",
                    shortDescription: "Построение и укрепление дружеских отношений.",
                    mainDescription: """
                    Люди с 19 Арканом являются источником радости и вдохновения для своих друзей. Они обладают способностью поддерживать позитивный настрой в любых обстоятельствах, что делает их надёжными и ценными друзьями. Их щедрость и умение слушать помогают укреплять дружеские связи.

                    Однако их стремление к активному образу жизни иногда может отдалять их от друзей, которые предпочитают более спокойное общение. Для укрепления дружбы важно находить время для разных форм взаимодействия и учитывать интересы других.

                    Уделяя внимание потребностям друзей и проявляя терпимость, они смогут создать дружеские отношения, которые будут наполнять жизнь радостью и взаимным уважением.
                    """
                ),
                Subcategory(
                    title: "Семейные отношения",
                    shortDescription: "Взаимодействие с членами семьи и родственниками.",
                    mainDescription: """
                    В семейных отношениях люди с 19 Арканом стремятся быть источником света и вдохновения. Они привносят в семью оптимизм, поддержку и искреннюю радость. Их стремление к гармонии помогает справляться с трудностями и укреплять семейные узы.

                    Однако их желание быть центром внимания иногда может вызывать недоразумения среди членов семьи. Для гармонии важно учиться делиться своим вниманием и учитывать мнение других.

                    Развивая способность к открытым обсуждениям и сохраняя позитивный настрой, они смогут укрепить свои семейные отношения и стать настоящей опорой для своих близких.
                    """
                ),
                Subcategory(
                    title: "Социальная адаптация",
                    shortDescription: "Умение общаться, налаживать контакты и интегрироваться в коллективы.",
                    mainDescription: """
                    Люди с 19 Арканом легко адаптируются в социальной среде благодаря своему позитивному настрою и открытости. Их способность вдохновлять и объединять людей делает их ценными участниками любого коллектива. Они могут стать лидерами, которые привносят в команду энергию и оптимизм.

                    Однако их потребность в признании иногда может мешать им принимать критику или учитывать мнение других. Для успешной социальной адаптации важно развивать навыки слушания и стремиться к более сбалансированному общению.

                    Укрепляя свои социальные навыки и проявляя терпимость, они смогут создать крепкие и вдохновляющие связи в коллективе, которые принесут пользу всем.
                    """
                ),
                Subcategory(
                    title: "Совместимость",
                    shortDescription: "Анализ с кем легче установить гармоничные и долгосрочные отношения.",
                    mainDescription: """
                    Люди с 19 Арканом совместимы с партнёрами, которые ценят их оптимизм, тепло и искренность. Они находят общий язык с теми, кто разделяет их активный подход к жизни и готов к открытым и вдохновляющим отношениям.

                    Трудности могут возникнуть с людьми, которые склонны к излишнему пессимизму или избегают выражения своих эмоций. Для успешного союза важно работать над взаимным уважением и учиться находить баланс между своими ожиданиями и реальностью.

                    Развивая чуткость и способность учитывать интересы партнёра, они смогут построить отношения, которые будут наполнены радостью, любовью и гармонией.
                    """
                )
            ]
        ),
        // MARK: - 20 Arkan
        20: ArkanInfo(
            title: "3. Отношения (20 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Романтические отношения",
                    shortDescription: "Перспективы в любви и браке, поиск гармонии в личной жизни.",
                    mainDescription: """
                    Ваше число в отношениях - 20 Аркан. Этот Аркан символизирует возрождение, осознание и готовность к новым этапам. Люди с этим числом судьбы в романтических отношениях обладают стремлением к глубокому пониманию своего партнёра и построению искренних и осознанных связей. Они способны извлекать уроки из прошлого, чтобы создать гармоничное будущее.

                    В любви они ищут партнёра, который готов расти и развиваться вместе с ними. Их стремление к самосовершенствованию делает их вдохновляющими партнёрами, которые поддерживают своего избранника в сложные моменты. Однако их склонность к самокритике иногда может вызывать чувство неуверенности в отношениях.

                    Для гармонии важно научиться принимать себя и своего партнёра такими, какие они есть, без излишней критики. Это поможет создать союз, основанный на доверии, взаимопонимании и стремлении к совместному развитию.
                    """
                ),
                Subcategory(
                    title: "Дружеские связи",
                    shortDescription: "Построение и укрепление дружеских отношений.",
                    mainDescription: """
                    Люди с 20 Арканом привлекают друзей своей мудростью и способностью к саморефлексии. Они помогают своим друзьям осознавать важные уроки и вдохновляют их на изменения, которые ведут к лучшей жизни. Их дружба часто становится основой для глубоких и осмысленных разговоров.

                    Однако их склонность анализировать всё, включая действия друзей, иногда может создавать напряжение. Для укрепления дружбы важно быть более терпимыми и готовыми принимать других такими, какие они есть.

                    Развивая способность к эмпатии и уменьшая излишнюю критичность, они смогут построить дружбу, которая будет вдохновлять обе стороны на личностный рост и гармонию.
                    """
                ),
                Subcategory(
                    title: "Семейные отношения",
                    shortDescription: "Взаимодействие с членами семьи и родственниками.",
                    mainDescription: """
                    В семейных отношениях люди с 20 Арканом стремятся к гармонии и осознанности. Они готовы анализировать семейные ситуации и искать решения, которые способствуют укреплению связей. Их способность извлекать уроки из прошлого помогает создавать атмосферу понимания и поддержки.

                    Однако их склонность к самокритике и анализу может иногда вызывать напряжение среди членов семьи. Для гармоничных отношений важно учиться отпускать прошлое и сосредотачиваться на настоящем.

                    Создавая атмосферу доверия и открытости, они смогут укрепить свои семейные узы и стать источником вдохновения для своих близких.
                    """
                ),
                Subcategory(
                    title: "Социальная адаптация",
                    shortDescription: "Умение общаться, налаживать контакты и интегрироваться в коллективы.",
                    mainDescription: """
                    Люди с 20 Арканом обладают способностью видеть глубинные причины социальных проблем и находить пути их решения. Они стремятся к гармонии и справедливости в коллективе, что делает их ценными участниками любой команды. Их стремление к осознанности помогает им находить общий язык даже с теми, с кем сложно работать.

                    Однако их склонность к излишнему анализу может иногда вызывать сопротивление со стороны окружающих. Для успешной адаптации важно развивать гибкость и умение легко включаться в коллективные процессы.

                    Укрепляя свои навыки взаимодействия и проявляя доброжелательность, они смогут интегрироваться в любое окружение и стать ценными участниками коллектива.
                    """
                ),
                Subcategory(
                    title: "Совместимость",
                    shortDescription: "Анализ с кем легче установить гармоничные и долгосрочные отношения.",
                    mainDescription: """
                    Люди с 20 Арканом совместимы с партнёрами, которые разделяют их стремление к осознанности и развитию. Они находят общий язык с теми, кто готов обсуждать глубокие темы и работать над построением гармоничных отношений.

                    Трудности могут возникнуть с людьми, которые избегают анализа или предпочитают не замечать сложностей. Для успешного союза важно находить баланс между осознанием проблем и умением наслаждаться моментом.

                    Укрепляя взаимное доверие и принимая несовершенства, они смогут построить отношения, которые будут вдохновлять на личностный рост и приносить радость обеим сторонам.
                    """
                )
            ]
        ),
        // MARK: - 21 Arkan
        21: ArkanInfo(
            title: "3. Отношения (21 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Романтические отношения",
                    shortDescription: "Перспективы в любви и браке, поиск гармонии в личной жизни.",
                    mainDescription: """
                    Ваше число в отношениях - 21 Аркан. Этот Аркан символизирует гармонию, завершённость и достижение полного единства. В романтической сфере люди с этим числом судьбы стремятся к созданию идеальных отношений, основанных на взаимопонимании и глубоком уважении. Их энергия направлена на то, чтобы партнёры дополняли друг друга, создавая сбалансированный и гармоничный союз.

                    Они склонны вкладывать много сил и времени в отношения, чтобы достичь этой гармонии. Их партнёры чувствуют поддержку и уверенность рядом с ними, что делает такие отношения стабильными. Однако их стремление к совершенству иногда может приводить к завышенным ожиданиям и недовольству мелкими несовершенствами.

                    Для достижения счастья в любви важно учиться принимать несовершенства и радоваться мелочам. Это поможет им создать отношения, в которых будет место как для великих достижений, так и для радостей повседневной жизни.
                    """
                ),
                Subcategory(
                    title: "Дружеские связи",
                    shortDescription: "Построение и укрепление дружеских отношений.",
                    mainDescription: """
                    Люди с 21 Арканом являются надёжными и верными друзьями, которые всегда готовы поддержать и вдохновить. Их стремление к гармонии отражается в их дружеских связях, где они стараются избегать конфликтов и создавать атмосферу взаимного уважения. Они ценят честность и открытость, что делает их дружбу крепкой и долгосрочной.

                    Однако их склонность к поиску идеала может иногда вызывать трудности в принятии недостатков друзей. Для укрепления дружеских связей важно быть более терпимыми и готовыми принимать людей такими, какие они есть.

                    Развивая терпимость и эмпатию, они смогут создать дружбу, которая станет для них источником радости и вдохновения.
                    """
                ),
                Subcategory(
                    title: "Семейные отношения",
                    shortDescription: "Взаимодействие с членами семьи и родственниками.",
                    mainDescription: """
                    В семейных отношениях люди с 21 Арканом играют роль миротворцев и вдохновителей. Они стремятся к созданию гармоничной и сбалансированной семейной атмосферы, где каждый член семьи чувствует себя ценным и услышанным. Их стремление к единству помогает укреплять семейные узы.

                    Однако их желание видеть всё идеально может иногда вызывать разочарование в сложных ситуациях. Для гармоничных отношений важно учиться принимать трудности как часть жизни и искать компромиссы.

                    Создавая атмосферу доверия и взаимного уважения, они смогут построить семью, которая станет примером единства и поддержки для всех её членов.
                    """
                ),
                Subcategory(
                    title: "Социальная адаптация",
                    shortDescription: "Умение общаться, налаживать контакты и интегрироваться в коллективы.",
                    mainDescription: """
                    Люди с 21 Арканом обладают уникальной способностью объединять людей и создавать гармоничные коллективы. Их стремление к балансу помогает решать конфликты и находить общие цели даже среди самых разных личностей. Они часто становятся лидерами, которые вдохновляют других своим примером.

                    Однако их стремление к совершенству иногда может мешать им быстро принимать решения или учитывать мнение меньшинства. Для успешной адаптации важно развивать гибкость и умение ценить разнообразие.

                    Проявляя терпимость и сохраняя свою энергию вдохновителя, они смогут создать крепкие связи в коллективе и стать незаменимыми в социальной среде.
                    """
                ),
                Subcategory(
                    title: "Совместимость",
                    shortDescription: "Анализ с кем легче установить гармоничные и долгосрочные отношения.",
                    mainDescription: """
                    Люди с 21 Арканом совместимы с партнёрами, которые ценят гармонию, стабильность и единство. Они находят общий язык с теми, кто стремится к развитию и готов работать над созданием сбалансированных отношений.

                    Трудности могут возникнуть с людьми, которые склонны к конфликтам или не готовы вкладываться в отношения. Для успешного союза важно учиться принимать несовершенства и сохранять терпимость.

                    Укрепляя взаимное доверие и поддерживая друг друга, они смогут создать отношения, которые будут источником радости, вдохновения и стабильности для обеих сторон.
                    """
                )
            ]
        ),
        // MARK: - 22 Arkan
        22: ArkanInfo(
            title: "3. Отношения (22 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Романтические отношения",
                    shortDescription: "Перспективы в любви и браке, поиск гармонии в личной жизни.",
                    mainDescription: """
                    Ваше число в отношениях - 22 Аркан. Этот Аркан символизирует свободу, спонтанность и открытость к новым возможностям. В романтических отношениях люди с этим числом судьбы стремятся к лёгкости, разнообразию и ярким эмоциям. Их партнёры находят в них источник вдохновения и удивительных открытий, что делает такие отношения насыщенными и увлекательными.

                    Однако их стремление к независимости и избеганию рутины может вызывать напряжение, особенно если партнёр ожидает стабильности. Они могут бояться обязательств или ограничений, что иногда мешает выстраивать долгосрочные отношения.

                    Для гармонии в любви важно находить баланс между свободой и привязанностью. Учитесь выражать свои чувства открыто и работать над укреплением доверия, чтобы создать отношения, которые будут наполнены радостью, свободой и взаимным уважением.
                    """
                ),
                Subcategory(
                    title: "Дружеские связи",
                    shortDescription: "Построение и укрепление дружеских отношений.",
                    mainDescription: """
                    Люди с 22 Арканом являются яркими и непредсказуемыми друзьями, которые всегда готовы привнести в дружбу что-то новое. Они привлекают друзей своим энтузиазмом, чувством юмора и умением находить приключения даже в повседневной жизни. Их дружеские связи часто наполнены спонтанностью и весельем.

                    Однако их стремление к свободе может иногда приводить к недоразумениям, если друзья ожидают большей стабильности или предсказуемости. Для укрепления дружбы важно находить время для искреннего общения и проявлять заботу о потребностях друзей.

                    Укрепляя баланс между спонтанностью и внимательностью, они смогут построить дружеские отношения, которые будут насыщены искренностью, весельем и взаимной поддержкой.
                    """
                ),
                Subcategory(
                    title: "Семейные отношения",
                    shortDescription: "Взаимодействие с членами семьи и родственниками.",
                    mainDescription: """
                    В семейных отношениях люди с 22 Арканом привносят лёгкость и жизнерадостность. Они способны вдохновлять своих близких на новые идеи и смотреть на жизнь с оптимизмом. Их энергия помогает создавать атмосферу, где каждый чувствует себя свободным и принятым.

                    Однако их стремление к независимости иногда может вызывать ощущение дистанции у членов семьи. Для гармоничных отношений важно учиться проявлять больше внимания и включённости в семейные дела.

                    Укрепляя взаимное уважение и сохраняя свою жизнерадостность, они смогут построить семью, где каждый член будет чувствовать поддержку и вдохновение.
                    """
                ),
                Subcategory(
                    title: "Социальная адаптация",
                    shortDescription: "Умение общаться, налаживать контакты и интегрироваться в коллективы.",
                    mainDescription: """
                    Люди с 22 Арканом обладают уникальной способностью привносить креативность и свежесть в коллектив. Их лёгкость в общении и способность находить общий язык с самыми разными людьми делает их ценными участниками любой команды. Они часто становятся инициаторами новых проектов и вдохновляют других своей нестандартной точкой зрения.

                    Однако их спонтанность иногда может восприниматься как непредсказуемость, что вызывает сложности в долгосрочной работе. Для успешной социальной адаптации важно развивать навыки планирования и учитывать потребности команды.

                    Создавая баланс между креативностью и надёжностью, они смогут стать важной частью коллектива и вдохновлять окружающих своим примером.
                    """
                ),
                Subcategory(
                    title: "Совместимость",
                    shortDescription: "Анализ с кем легче установить гармоничные и долгосрочные отношения.",
                    mainDescription: """
                    Люди с 22 Арканом совместимы с партнёрами, которые ценят свободу, креативность и лёгкость в отношениях. Они находят общий язык с теми, кто готов разделить их жизнерадостный и открытый подход к жизни.

                    Трудности могут возникнуть с людьми, которые склонны к рутине или требуют высокой степени стабильности. Для успешного союза важно работать над взаимным доверием и находить общие точки соприкосновения.

                    Развивая терпимость и укрепляя эмоциональную связь, они смогут построить отношения, которые будут насыщены приключениями, радостью и глубоким взаимопониманием.
                    """
                )
            ]
        ),
    ]
}
