//
//  RecommendationsData.swift
//  DestinyMatrix
//
//  Created by Иван Семикин on 09/11/2024.
//

import Foundation

struct RecommendationsData {
    static let allArkans: ArkanDictionary = [
        // MARK: - 1 Arkan
        1: ArkanInfo(
            arkanNumber: 1,
            shortDescription: "",
            mainDescription: "",
            positiveEnergyText: "",
            negativeEnergyText: "",
            adviceText: """
                - **Профессии**: Рассмотрите управленческие и ответственные роли, такие как директор, старший менеджер, проектный руководитель, бизнес-консультант или специалист по стратегическому развитию. Подойдут также сферы, где важны навыки влияния и управления, например, маркетинг или стартапы. Эти профессии позволяют вам проявить лидерские качества и вдохновлять других, что важно для вашего роста и самореализации.
                
                - **Здоровье**: Уделяйте внимание регулярным физическим нагрузкам, таким как функциональные тренировки, кроссфит или йога, чтобы поддерживать уровень энергии и ясность ума. Избегайте переутомления и находите время для медитации или техник осознанного расслабления — это поможет сбалансировать вашу энергию и избежать стресса.
                
                - **Отношения**: В отношениях важно проявлять гибкость и готовность слушать партнёра, чтобы избежать конфликтов и усилить доверие. Избегайте излишнего контроля и помните, что уважение к мнению и чувствам других только укрепляет вашу связь. Постарайтесь поддерживать баланс между уверенностью и чуткостью, чтобы отношения развивались гармонично.
                
                - **Саморазвитие**: Сфокусируйтесь на развитии эмпатии и навыков командного взаимодействия. Участвуйте в тренингах по эмоциональному интеллекту, лидерским курсам и семинарам, направленным на улучшение общения. Постоянно ищите возможности улучшать свои навыки, это сделает вас ещё более успешным и поможет избежать недопонимания.
                """
        ),
        
        // MARK: - 2 Arkan
        2: ArkanInfo(
            arkanNumber: 2,
            shortDescription: "",
            mainDescription: "",
            positiveEnergyText: "",
            negativeEnergyText: "",
            adviceText: """
                - **Профессии**: Для вас подходят роли, где требуется глубокое понимание и интуиция. Рассмотрите профессии психолога, наставника, исследователя или консультанта по духовным вопросам. Также подойдут области, связанные с поддержкой и обучением, такие как преподавание или коучинг.
                
                - **Здоровье**: Слушайте своё тело и уделяйте внимание его сигналам. Практики медитации, йоги или дыхательные упражнения помогут вам поддерживать баланс и укреплять интуицию. Избегайте стресса и создавайте вокруг себя гармоничную среду.
                
                - **Отношения**: Вам важно выстраивать глубокие, доверительные связи. Учитесь делиться своими чувствами и не бойтесь открываться близким людям. В отношениях старайтесь быть гибким и терпеливым, чтобы избежать ненужного напряжения.
                
                - **Саморазвитие**: Развивайте интуицию и внутреннее осознание. Чтение, занятия самоанализом и духовные практики помогут вам глубже понимать себя и находить ответы на жизненные вопросы. Это усилит вашу связь с внутренним миром и принесёт вам внутреннюю уверенность.
                """
        ),
        
        // MARK: - 3 Arkan
        3: ArkanInfo(
            arkanNumber: 3,
            shortDescription: "",
            mainDescription: "",
            positiveEnergyText: "",
            negativeEnergyText: "",
            adviceText: """
                - **Профессии**: Вам подходят творческие и выразительные профессии, такие как маркетолог, дизайнер, арт-директор, писатель или бренд-менеджер. В сфере медиа, культуры и искусства вы сможете проявить креативность и вдохновить окружающих. Рассмотрите также роли, связанные с публичными выступлениями, такие как оратор или ведущий — это подчеркнёт ваши таланты.
                
                - **Здоровье**: Следите за эмоциональным балансом и регулярно занимайтесь видами физической активности, которые позволяют выражать себя, например, танцами или йогой. Медитации и дыхательные практики помогут стабилизировать эмоциональное состояние и повысить уровень энергии.
                
                - **Отношения**: Выражайте свои чувства открыто, но старайтесь контролировать импульсивность, чтобы избежать непонимания. Важно делиться эмоциями и поддерживать гармонию в отношениях, проявляя внимание к партнёру. Ваше умение вдохновлять и быть искренним ценится, но старайтесь не терять равновесия.
                
                - **Саморазвитие**: Участвуйте в тренингах по публичным выступлениям, самовыражению и работе с эмоциями. Это поможет вам лучше контролировать свои чувства и выражать их таким образом, чтобы укреплять взаимоотношения с окружающими.
                """
        ),
        
        // MARK: - 4 Arkan
        4: ArkanInfo(
            arkanNumber: 4,
            shortDescription: "",
            mainDescription: "",
            positiveEnergyText: "",
            negativeEnergyText: "",
            adviceText: """
                - **Профессии**: Вам подойдут роли, требующие аналитического мышления и точности, такие как юрист, экономист, финансовый аналитик, инженер или консультант по бизнес-процессам. Это профессии, где структурированность и организованность особенно важны, а ваш перфекционизм позволит добиваться высокого уровня профессионализма.
                
                - **Здоровье**: Регулярность и стабильность крайне важны. Поддерживайте активный образ жизни через структурированные тренировки, такие как плавание, пилатес или фитнес. Эти практики помогают поддерживать тело в тонусе и улучшать общую выносливость.
                
                - **Отношения**: В общении с партнёром постарайтесь проявлять терпимость и гибкость. Избегайте излишнего перфекционизма и контролирующего поведения. Создавайте атмосферу, где обе стороны могут выразить своё мнение. Это укрепит доверие и поможет избежать конфликтов.
                
                - **Саморазвитие**: Регулярно работайте над гибкостью мышления и эмоциональной зрелостью. Рассмотрите тренинги по личностному развитию и адаптации, а также упражнения на повышение эмоционального интеллекта. Это укрепит вашу способность работать в команде и откроет новые возможности в общении и профессиональной деятельности.
                """
        ),
        
        // MARK: - 5 Arkan
        5: ArkanInfo(
            arkanNumber: 5,
            shortDescription: "",
            mainDescription: "",
            positiveEnergyText: "",
            negativeEnergyText: "",
            adviceText: """
                - **Профессии**: Вы сможете реализовать себя в областях, где важны наставничество, поддержка и мотивация, такие как коучинг, психотерапия, HR-менеджмент, или образовательная деятельность. Также стоит рассмотреть роли в консалтинге, управлении проектами, социальной работе или психологии. В этих профессиях вы сможете применить свои навыки мотивации, анализа и поддержку людей в их развитии.
                
                - **Здоровье**: Важно заботиться о своём эмоциональном и физическом состоянии. Практики осознанности, такие как медитация и дыхательные упражнения, помогут вам сохранять внутренний баланс и управлять стрессом. Уделяйте внимание полноценному сну и физическим нагрузкам, включая йогу или пилатес, которые поддержат ваше тело и ум в гармонии.
                
                - **Отношения**: В общении старайтесь проявлять терпение и эмпатию, особенно в сложных ситуациях. Важно поддерживать открытость и доверие, чтобы избежать непонимания и напряжения. Стремитесь к диалогу и будьте готовы к компромиссам, так вы сможете построить крепкие и взаимоподдерживающие отношения.
                
                - **Саморазвитие**: Вложите время в изучение психологических техник и практик саморазвития, таких как коучинг и эмоциональный интеллект. Участие в семинарах и тренингах по психологии и управлению поможет вам углубить знания и развивать навыки, необходимые для карьерного роста и личного успеха.
                """
        ),
        
        // MARK: - 6 Arkan
        6: ArkanInfo(
            arkanNumber: 6,
            shortDescription: "",
            mainDescription: "",
            positiveEnergyText: "",
            negativeEnergyText: "",
            adviceText: """
                - **Профессии**: Сфера искусства и дизайна вам идеально подходит. Рассмотрите карьеры, связанные с модой, архитектурой, фотографией, кинематографом и графическим дизайном. Также вас могут заинтересовать роли арт-директора, креативного директора или консультанта по стилю, где можно проявить свою эстетику и творческое видение.
                
                - **Здоровье**: Важно сохранять баланс между физическим и эмоциональным состоянием. Практики расслабления, такие как йога, медитации и занятия в открытом воздухе, помогут поддерживать гармонию. Включите в свою жизнь хобби, которые вам нравятся и вдохновляют, будь то танцы, искусство или музыка.
                
                - **Отношения**: Стремитесь к созданию уюта и красоты в общении, придавайте значение атмосфере и взаимодействию. В отношениях важен баланс и доверие. Не бойтесь проявлять свои чувства и открыто обсуждать проблемы. Это создаст гармоничные и приятные отношения.
                
                - **Саморазвитие**: Посещайте художественные выставки, мастер-классы или курсы по искусству, где сможете расширить свои знания и навыки. Саморазвитие через творческие практики поможет вам ещё лучше понять себя и вдохновлять других своим уникальным стилем.
                """
        ),
        
        // MARK: - 7 Arkan
        7: ArkanInfo(
            arkanNumber: 7,
            shortDescription: "",
            mainDescription: "",
            positiveEnergyText: "",
            negativeEnergyText: "",
            adviceText: """
                - **Профессии**: Вам подойдут роли, требующие дисциплины и анализа, такие как юрист, финансовый аналитик, стратегический консультант или научный исследователь. Также рассмотрите карьеры в управлении проектами и инженерии, где можно проявить свои способности к детальному планированию и структуре.
                
                - **Здоровье**: Чтобы поддерживать баланс, полезно заниматься спортом, требующим концентрации и выносливости, например, бегом, плаванием или силовыми тренировками. Это позволит вам укрепить тело и ум, а также улучшить самоорганизацию и дисциплину.
                
                - **Отношения**: Важно поддерживать в отношениях равновесие, не замыкаясь в своих мыслях и ожиданиях. Практикуйте терпение и внимание к партнёру, позволяя отношениям быть гармоничными и устойчивыми.
                
                - **Саморазвитие**: Развивайте аналитические и управленческие навыки через книги и курсы по стратегии, планированию и финансовой грамотности. Саморазвитие в этих направлениях откроет вам новые карьерные возможности и укрепит уверенность.
                """
        ),
        
        // MARK: - 8 Arkan
        8: ArkanInfo(
            arkanNumber: 8,
            shortDescription: "",
            mainDescription: "",
            positiveEnergyText: "",
            negativeEnergyText: "",
            adviceText: """
                - **Профессии**: Вам подходят сферы юриспруденции, финансов, управления и консалтинга. Рассмотрите роли судьи, адвоката, руководителя отдела, финансового аналитика или HR-менеджера. Ваше чувство справедливости и аналитические способности помогут вам в высокоответственных и значимых ролях.
                
                - **Здоровье**: Чтобы сохранять баланс, уделяйте внимание регулярным физическим нагрузкам, которые помогают поддерживать выносливость, таким как силовые тренировки или бег. Не забывайте о регулярных медитативных практиках для улучшения концентрации.
                
                - **Отношения**: Стремитесь к поддержанию равновесия между профессиональной и личной жизнью. Поддерживайте честность и доверие в общении, сохраняя при этом возможность для гибкости и компромиссов.
                
                - **Саморазвитие**: Развивайте навыки переговоров, лидерства и принятия решений. Книги и курсы по менеджменту, лидерству и личностному росту будут полезны для достижения успеха как в карьере, так и в жизни.
                """
        ),
        
        // MARK: - 9 Arkan
        9: ArkanInfo(
            arkanNumber: 9,
            shortDescription: "",
            mainDescription: "",
            positiveEnergyText: "",
            negativeEnergyText: "",
            
            adviceText: """
                - **Профессии**: Вам подойдут роли, в которых вы сможете реализовать свои аналитические и интуитивные способности. Рассмотрите карьеру психолога, философа, писателя, учёного или коуча. Также могут быть интересны профессии, связанные с исследованиями или консалтингом, где можно углублённо анализировать данные и явления.
                
                - **Здоровье**: Для поддержания жизненного баланса уделяйте внимание медитации и методам саморефлексии, которые помогут расслабить ум. Прогулки на природе, тихие виды спорта, такие как йога или тай-чи, позволят восстановить силы и избежать выгорания.
                
                - **Отношения**: В отношениях старайтесь быть открытым и честным с близкими, делитесь своими мыслями и чувствами. Найдите время для совместных обсуждений и уделяйте внимание пониманию своих и чужих потребностей. Это поможет вам сохранять близкие и доверительные связи.
                
                - **Саморазвитие**: Постоянно развивайте навыки самоанализа и глубокого мышления. Изучайте психологию, философию, возможно, астрологию, чтобы лучше понимать себя и людей. Вам будет полезно углубляться в изучение внутренних процессов и духовных практик.
                """
        ),
        
        // MARK: - 10 Arkan
        10: ArkanInfo(
            arkanNumber: 10,
            shortDescription: "",
            mainDescription: "",
            positiveEnergyText: "",
            negativeEnergyText: "",
            
            adviceText: """
                - **Профессии**: Сферы, где важны адаптивность и быстрота принятия решений, подойдут вам идеально. Рассмотрите карьеру проектного менеджера, аналитика, финансового консультанта, инвестора или специалиста по маркетингу. Ваша способность к адаптации и гибкости делает вас ценным сотрудником, особенно в динамичных компаниях.
                
                - **Здоровье**: Занимайтесь активными видами спорта, которые помогают поддерживать выносливость и быстро восстанавливать силы. Плавание, танцы и пилатес отлично подойдут. Важно придерживаться регулярного распорядка дня, чтобы укрепить физическое здоровье и эмоциональное равновесие.
                
                - **Отношения**: Будьте готовы к изменениям в отношениях и старайтесь поддерживать гибкость в общении. Постоянное обсуждение и готовность адаптироваться помогут вам лучше понять друг друга и поддерживать гармонию.
                
                - **Саморазвитие**: Изучайте основы эмоциональной устойчивости и развития гибкости. Курсы по психологии помогут вам глубже понимать человеческие эмоции, а тренинги по стресс-менеджменту позволят уверенно реагировать на любые перемены.
                """
        ),
        
        // MARK: - 11 Arkan
        11: ArkanInfo(
            arkanNumber: 11,
            shortDescription: "",
            mainDescription: "",
            positiveEnergyText: "",
            negativeEnergyText: "",
            
            adviceText: """
                - **Профессии**: Вы успешно реализуетесь в ролях, где важны уверенность и сила личности. Рассмотрите карьеру тренера, руководителя, коуча или бизнес-консультанта. Ваша решительность и настойчивость помогут вам достичь высоких целей, особенно в управленческих позициях.
                
                - **Здоровье**: Для поддержания физического и эмоционального баланса добавьте в свой распорядок дня регулярные физические тренировки, такие как силовые упражнения и йога. Это поможет управлять внутренней энергией и оставаться в гармонии с самим собой.
                
                - **Отношения**: Учитесь проявлять гибкость в отношениях, так как ваша сила иногда может быть воспринята как доминирование. Поддерживайте открытость и умение слушать, чтобы построить доверительные и гармоничные связи.
                
                - **Саморазвитие**: Углубляйте навыки самоконтроля и управления эмоциями. Практики медитации и осознанности помогут вам сохранять ясность и внутреннюю гармонию, раскрывая потенциал вашей личной силы.
                """
        ),
        
        // MARK: - 12 Arkan
        12: ArkanInfo(
            arkanNumber: 12,
            shortDescription: "",
            mainDescription: "",
            positiveEnergyText: "",
            negativeEnergyText: "",
            
            adviceText: """
                - **Профессии**: Ваша способность к созданию и управлению проектами требует ролей, где нужен стратегический взгляд и долгосрочное планирование. Подойдут профессии проектного менеджера, стартап-основателя, финансового аналитика, директора по развитию, а также карьерный путь в сфере консалтинга и стратегического планирования. Важно выбирать такие роли, которые позволяют вам видеть картину в целом и принимать решения, влияющие на будущее.
                
                - **Здоровье**: Важно поддерживать баланс между физической и ментальной активностью. Включите в свою жизнь упражнения на развитие силы воли, такие как медитация, йога или тайцзи. Занятия спортом, которые развивают не только тело, но и дух, помогут укрепить внутреннюю устойчивость и справляться с любыми жизненными трудностями.
                
                - **Отношения**: В личных отношениях вам нужно стремиться к установлению баланса между активной жизненной позицией и уважением потребностей партнера. Старайтесь уделять внимание взаимному росту, заботясь не только о своих целях, но и о целях близких людей. Будьте готовы к тому, чтобы идти на компромиссы и делиться своей внутренней силой с теми, кого любите.
                
                - **Саморазвитие**: Постоянно ищите способы улучшения себя через самопознание и саморефлексию. Читайте книги по личной эффективности, посещайте тренинги по лидерству и управлению. Работайте над своим внутренним миром, чтобы ваше внешнее влияние было позитивным и конструктивным. Осознавая свои сильные стороны, вы сможете более эффективно использовать их в жизни и в работе.
                """
        ),
        
        // MARK: - 13 Arkan
        13: ArkanInfo(
            arkanNumber: 13,
            shortDescription: "",
            mainDescription: "",
            positiveEnergyText: "",
            negativeEnergyText: "",
            
            adviceText: """
                - **Профессии**: Ваша способность к трансформации и поиску глубоких смыслов подсказывает, что вам подойдут профессии в сфере психологии, терапии, а также работа с восстановлением и лечением. Рассмотрите карьеру психотерапевта, консультанта, врача, наставника, тренера по личностному росту, а также роли в тех областях, где нужно работать с людьми, испытывающими кризисы или сложности в жизни.
                
                - **Здоровье**: Обратите внимание на важность эмоционального и психологического здоровья. Стрессы и внутренние переживания могут оказывать серьезное влияние на ваше физическое состояние. Регулярно занимайтесь дыхательными практиками, медитацией, научитесь расслабляться и отпускать негатив. Старайтесь уделять время отдыху и прогулкам на свежем воздухе, чтобы восстанавливать силы.
                
                - **Отношения**: В отношениях с людьми учитесь не только давать поддержку, но и быть открытым для получения этой поддержки. Ваши навыки слушания и понимания людей позволяют создать гармоничные и доверительные отношения. Будьте внимательны к эмоциональным потребностям партнера, научитесь отпускать прошлое и прощать.
                
                - **Саморазвитие**: Вам важно работать над своими эмоциональными блоками, научиться отпускать переживания и сосредотачиваться на настоящем. Освободитесь от старых шаблонов мышления и страхов, чтобы двигаться вперёд. Развивайте навыки работы с эмоциями, возможно, занимайтесь практиками исцеления, такими как рейки или медитация, для очистки энергетических каналов.
                """
        ),
        
        // MARK: - 14 Arkan
        14: ArkanInfo(
            arkanNumber: 14,
            shortDescription: "",
            mainDescription: "",
            positiveEnergyText: "",
            negativeEnergyText: "",
            
            adviceText: """
                - **Профессии**: Вам подойдут роли, в которых требуется работать в динамичных и быстро меняющихся условиях. Рассмотрите карьеру в области маркетинга, PR, в стартапах, а также роли, связанные с коммуникациями и координацией работы разных команд. Работы в сфере IT, управление проектами, консультирование — все эти профессии могут стать вашим путём к успеху, если вы будете эффективно организовывать работу и наладить связи.
                
                - **Здоровье**: Физическое состояние играет важную роль, и вам нужно быть внимательным к своему телесному состоянию. Постоянные стрессы могут давать сбои в здоровье, поэтому регулярные тренировки и занятия спортом помогут вам поддерживать силу и энергию. Спорт на свежем воздухе, такие как бег, велосипед или плавание, прекрасно подходят для вашего образа жизни.
                
                - **Отношения**: В отношениях важно проявлять терпимость и гибкость. Ваша активность и стремление к развитию должны сочетаться с умением находить компромиссы и понимать потребности других. Будьте готовы учить и вдохновлять, но в то же время не забывайте о важности равновесия и взаимопонимания в отношениях.
                
                - **Саморазвитие**: Стремитесь к развитию как в личном, так и в профессиональном плане. Обучение новым навыкам, постоянное расширение кругозора и совершенствование в своей профессии сделают вас не только успешным, но и востребованным. Не бойтесь новых вызовов, пробуйте работать с другими сферами и выходить за рамки привычного.
                """
        ),
        
        // MARK: - 15 Arkan
        15: ArkanInfo(
            arkanNumber: 15,
            shortDescription: "",
            mainDescription: "",
            positiveEnergyText: "",
            negativeEnergyText: "",
            
            adviceText: """
                - **Профессии**: Вам подойдут профессии, связанные с созданием и управлением, где необходимо вдохновлять других на достижение больших целей. Роли в области управления, корпоративной культуры, стартапов, а также профессии, связанные с высокими технологиями и инновациями, такие как продакт-менеджер, бизнес-аналитик, руководитель отдела разработки или стратег, будут наиболее подходящими для вашего профиля.
                
                - **Здоровье**: Здоровье для вас — это важный аспект, который требует баланса между умственным и физическим состоянием. Регулярные тренировки, медитации, а также йога помогут вам справляться с стрессами, поддерживать энергетический баланс и при этом сохранять внутреннюю гармонию. Помните о важности восстановления после умственного перенапряжения и обеспечьте себе достаточный отдых.
                
                - **Отношения**: В отношениях с другими важно научиться строить доверие и уважение. Постарайтесь создавать атмосферу, где каждому партнеру есть место для роста и самовыражения. Ваши навыки управлять людьми и ситуациями помогут вам быть стабильным и надежным партнером, а также вдохновлять окружающих на новые высоты.
                
                - **Саморазвитие**: Ставьте перед собой амбициозные цели и достигайте их, но также учитесь быть терпимым к себе. Развивайте навыки стратегического мышления и лидерства, читайте книги по личной эффективности, принимайте участие в тренингах и семинарах, чтобы быть готовыми к любым жизненным вызовам. Не бойтесь развивать лидерские качества и применяйте их на практике.
                """
        ),
        
        // MARK: - 16 Arkan
        16: ArkanInfo(
            arkanNumber: 16,
            shortDescription: "",
            mainDescription: "",
            positiveEnergyText: "",
            negativeEnergyText: "",
            
            adviceText: """
                - **Профессии**: Идеальными для вас являются роли, связанные с инновациями и внедрением новых технологий. Подойдут такие профессии, как инженер-программист, архитектор, дизайнер, стартап-основатель, а также маркетинг и стратегии. Важно заниматься деятельностью, которая дает вам возможность работать с новыми идеями и менять окружающий мир.
                
                - **Здоровье**: Психоэмоциональное состояние напрямую влияет на ваше физическое здоровье. Чтобы оставаться в форме, важно сбалансировать активность с расслаблением. Занятия спортом, такие как плавание, бег или пилатес, помогут вам укрепить тело и поддерживать энергетический баланс. Не забывайте уделять время отдыху, чтобы восстановить силы после интенсивной работы.
                
                - **Отношения**: В отношениях важно быть честным и открытым. Научитесь выстраивать доверительные отношения, чтобы избежать конфликта и недопонимания. Ваши лидерские качества и стремление к независимости могут иногда заставлять партнера чувствовать себя на втором плане. Важно помнить о балансе и умении слушать.
                
                - **Саморазвитие**: Работайте над собой, изучая новое и не бойтесь внедрять нестандартные идеи в жизнь. Развивайте креативность и учитесь смотреть на мир под другим углом. Постоянное самосовершенствование и работа с собственными убеждениями поможет вам достичь нового уровня жизни. Применяйте новые знания и практики в своей повседневной жизни.
                """
        ),
        
        // MARK: - 17 Arkan
        17: ArkanInfo(
            arkanNumber: 17,
            shortDescription: "",
            mainDescription: "",
            positiveEnergyText: "",
            negativeEnergyText: "",
            
            adviceText: """
                - **Профессии**: Если вы стремитесь к независимости и лидерству, вам подойдут профессии, где вы можете действовать самостоятельно, но при этом оказывать влияние на окружающих. Идеальными будут такие профессии, как предприниматель, инвестор, эксперт, топ-менеджер. Также стоит обратить внимание на карьеру в области инновационных технологий, где нужно быстро принимать решения и адаптироваться к изменениям.
                
                - **Здоровье**: Очень важно контролировать уровень стресса, поскольку ваша активная жизнь и стремление к постоянному успеху могут оказывать давление на ваше психоэмоциональное состояние. Для поддержания здорового баланса важно выделять время для физических упражнений и расслабления. Практикуйте дыхательные техники и уделяйте внимание своему ментальному здоровью, чтобы поддерживать внутреннюю гармонию.
                
                - **Отношения**: В отношениях с окружающими вам стоит учиться отпускать контроль и доверять людям. Важно дать своему партнеру пространство для личного роста и быть готовым делиться ответственностью. Поддерживайте открытость и доверие, чтобы отношения не стали нагрузкой, а приносили радость и поддержку.
                
                - **Саморазвитие**: Для того чтобы выйти на новый уровень, продолжайте развивать свои лидерские качества и умение вести за собой людей. Работайте над повышением эмоциональной интеллигентности, развивайте уверенность в себе и в своем выборе. Важно также научиться отпускать прошлое и не зацикливаться на нем, чтобы идти вперед.
                """
        ),
        
        // MARK: - 18 Arkan
        18: ArkanInfo(
            arkanNumber: 18,
            shortDescription: "",
            mainDescription: "",
            positiveEnergyText: "",
            negativeEnergyText: "",
            
            adviceText: """
                - **Профессии**: Вам подойдут профессии, связанные с помощью другим людям, наставничеством и консультированием. Роли в социальной сфере, такие как психотерапевт, тренер по личностному росту, психолог, а также карьера в области образования и медицины могут быть для вас идеальными. Также можете рассмотреть карьеру в области HR, где важно помогать людям раскрывать свой потенциал и улучшать жизнь.
                
                - **Здоровье**: Очень важно поддерживать эмоциональное и физическое равновесие. Работайте над восстановлением своих сил через расслабляющие практики, такие как медитация, йога и прогулки на свежем воздухе. Включите в свою жизнь дыхательные упражнения, которые помогут снижать уровень стресса и поддерживать внутреннюю гармонию.
                
                - **Отношения**: В отношениях важно научиться находить баланс между личными и семейными потребностями. Вы можете быть глубоко эмоциональны, и важно научиться управлять своими чувствами, чтобы они не выходили из-под контроля. Слушайте своего партнера и старайтесь быть понимающим и внимательным, чтобы отношения стали стабильными и полными уважения.
                
                - **Саморазвитие**: Постоянно работайте над собой, развивайте навыки самоосознания и внутренней гармонии. Занимайтесь саморефлексией, прислушивайтесь к себе и старайтесь решать внутренние конфликты. Практикуйте медитацию и методы самопомощи, чтобы поддерживать душевное равновесие и быть более гармоничным человеком.
                """
        ),
        
        // MARK: - 19 Arkan
        19: ArkanInfo(
            arkanNumber: 19,
            shortDescription: "",
            mainDescription: "",
            positiveEnergyText: "",
            negativeEnergyText: "",
            
            adviceText: """
                - **Профессии**: Ваша энергия подходит для профессий, связанных с публичными выступлениями, лидерством и вдохновением других. Рассмотрите карьеру в таких областях, как управление проектами, политика, активизм, публичные выступления, а также продюсирование и создание контента. Ваша способность влиять на людей через общение и идеи поможет вам достичь успеха в любой сфере, где важна харизма и лидерство.
                
                - **Здоровье**: Для вас крайне важно поддерживать баланс между активной профессиональной деятельностью и личным временем. Постоянные стрессовые ситуации могут привести к выгоранию, поэтому важно заниматься физическими упражнениями, которые помогают расслабиться и восстанавливать силы. Спортивные тренировки, плавание, бег и другие кардионагрузки станут отличным выбором.
                
                - **Отношения**: В отношениях с людьми важно проявлять заботу и внимание, но в то же время избегать чрезмерной эмоциональной нагрузки. Научитесь разделять личные и профессиональные отношения, чтобы не перегружать себя и близких. Важно быть открытым и честным, а также готовым к компромиссам.
                
                - **Саморазвитие**: Развивайте свою способность влиять на других людей и учитесь управлять своими эмоциями. Работайте над личной харизмой, уверенности в себе и улучшении навыков публичных выступлений. Важно постоянно работать над собой и повышать свою внутреннюю силу, чтобы быть не только успешным, но и вдохновлять других.
                """
        ),
        
        // MARK: - 20 Arkan
        20: ArkanInfo(
            arkanNumber: 20,
            shortDescription: "",
            mainDescription: "",
            positiveEnergyText: "",
            negativeEnergyText: "",
            
            adviceText: """
                - **Профессии**: Для вас подойдут профессии, которые позволяют выражать творчество и нестандартное мышление. Рассмотрите карьеру в области искусства, дизайна, фотографии, а также в сфере инноваций и технологий. Ваша способность видеть мир под необычным углом и подходить к задачам с креативностью сделает вас успешным в профессиях, требующих креативного подхода.
                
                - **Здоровье**: Важно уделять внимание психоэмоциональному состоянию, так как ваше творчество требует внутренней гармонии. Занимайтесь расслабляющими практиками, такими как йога, медитация и арт-терапия. Это поможет вам снизить уровень стресса и увеличить творческую энергию. Помните, что отдых и восстановление также необходимы для поддержания вашего здоровья.
                
                - **Отношения**: В отношениях важно находить баланс между собственными потребностями и потребностями партнера. Научитесь открыто говорить о своих чувствах и нуждах, чтобы избежать недоразумений. Ваше желание быть понятым и поддерживающим важно учитывать в отношениях, создавая пространство для взаимной поддержки и роста.
                
                - **Саморазвитие**: Развивайте свою креативность и стремление к самовыражению. Пробуйте различные виды искусства, такие как живопись, музыка, танцы или писательство, чтобы развить свой творческий потенциал. Постоянно работайте над собой, ища новые способы самовыражения, это не только поможет вам раскрыть себя, но и будет приносить удовлетворение.
                """
        ),
        
        // MARK: - 21 Arkan
        21: ArkanInfo(
            arkanNumber: 21,
            shortDescription: "",
            mainDescription: "",
            positiveEnergyText: "",
            negativeEnergyText: "",
            
            adviceText: """
                - **Профессии**: Ваши сильные качества идеально подходят для работы в управлении, в сфере аналитики и консультирования. Рекомендуются профессии, такие как стратегический консультант, финансист, эксперт по рискам или корпоративный тренер. Вы также можете преуспеть в таких областях, как судебные дела, право, аудит и финансирование, где важен аналитический подход и внимание к деталям.
                
                - **Здоровье**: Важно поддерживать баланс между умственной деятельностью и физической активностью. Регулярные занятия спортом помогут вам справляться с высокими умственными нагрузками и поддерживать физическое здоровье. Рекомендуются такие активности, как плавание, теннис, йога или тренировки в тренажерном зале, которые помогут снять стресс и сохранить гармонию в теле.
                
                - **Отношения**: В отношениях вам важно находить партнёра, который разделяет вашу интеллектуальную силу и амбиции. Вы можете быть склонны к высокому уровню независимости, что иногда может привести к отстранению от партнёра. Постарайтесь открыться и проявить больше гибкости, чтобы поддерживать здоровую эмоциональную связь.
                
                - **Саморазвитие**: Развивайте в себе лидерские качества и работайте над улучшением своих аналитических способностей. Пройдите курсы по стратегическому управлению или корпоративному праву. Это поможет вам достичь профессионального роста и развить навыки, необходимые для успешного лидерства. Постоянно обучайтесь и не останавливайтесь на достигнутом.
                """
        ),
        
        // MARK: - 22 Arkan
        22: ArkanInfo(
            arkanNumber: 22,
            shortDescription: "",
            mainDescription: "",
            positiveEnergyText: "",
            negativeEnergyText: "",
            
            adviceText: """
                - **Профессии**: Вам подойдут профессии, связанные с инновациями, разработками и внедрением новых технологий. Роли в таких областях, как инженерия, архитектор, стартап-основатель, а также в сфере биотехнологий, медицины, экологической устойчивости и энергетики. Профессии, требующие креативности и нестандартного мышления, станут для вас источником вдохновения и успеха.
                
                - **Здоровье**: Важно поддерживать психическое и физическое здоровье, находя баланс между карьерой и личным временем. Регулярные физические нагрузки, а также занятия спортом на свежем воздухе помогут снизить стресс и поддержать высокий уровень энергии. Силовые тренировки, бег, активные прогулки и плавание будут отличными занятиями для укрепления здоровья.
                
                - **Отношения**: В отношениях важно искать партнёра, который поддержит ваш стремительный рост и будет разделять вашу страсть к новым идеям и изменениям. Постарайтесь не поглощать себя работой и уделять внимание близким. Открытое общение и проявление любви и поддержки со стороны партнёра помогут вам быть счастливым и гармоничным.
                
                - **Саморазвитие**: Работайте над развитием своей креативности и инновационного мышления. Погружение в новые идеи и исследования в области технологий или искусства поможет вам стать успешным. Включайте в свою жизнь практики, которые помогут вам сохранять энергию и быть открытым к новым возможностям. Практикуйте саморазвитие и ищите новые способы самовыражения, чтобы раскрыть свой максимальный потенциал.
                """
        )
    ]
}
