//
//  OnboardingText.swift
//  DestinyMatrix
//
//  Created by Иван Семикин on 28/10/2024.
//

import Foundation

struct OnboardingTextModel {
    static let introductionText = """
    Давным-давно тайные знания о судьбе были сокрыты в священных ритуалах древних племён. Из века в век, шаманы и мудрецы обращались к числам и звёздам, стремясь постичь великие загадки бытия.

    Теперь эти секреты открыты для вас. “Матрица Судьбы” использует методы, разработанные лучшими астрологами мира, и новейшие достижения искусственного интеллекта, чтобы предложить вам глубочайший анализ вашей жизни.

    Матрица Судьбы раскрывает важные аспекты: жизненные пути, личные цели, ключевые черты характера и скрытые таланты. Она станет вашим проводником на пути самопознания и покажет, как найти гармонию с самим собой и Вселенной.
    """
}
