//
//  dds.swift
//  DestinyMatrix
//
//  Created by Иван Семикин on 01/11/2024.
//

import Foundation

struct OnboardingTextModel {
    static let introductionText = """
    “Матрица Судьбы” — это уникальный инструмент для глубокого самопознания, объединяющий древние знания и новейшие достижения искусственного интеллекта.

    Каждое число в вашей жизни — это код, который раскрывает ваши сильные стороны, таланты и жизненные цели. Это не магия — это наука о вас.

    С помощью мощных аналитических методов и искусственного интеллекта нового поколения мы расшифруем скрытые коды вашей жизни и поможем вам взглянуть на свою жизнь по-новому.

    Это не просто анализ — это персональное руководство, которое поможет вам стать лучшей версией себя и создать реальность, о которой вы всегда мечтали.
    """
}
