//
//  DestinyNumberArkans.swift
//  DestinyMatrix
//
//  Created by Иван Семикин on 02/12/2024.
//

import Foundation

struct DestinyNumberArkans {
    static let allArkans: ArkanDictionaryNew = [
        // MARK: - 1 Arkan
        1: ArkanInfoNew(
            title: "1. Число Судьбы (1 Аркан)",
            subcategories: [
                Subcategory(
                    title: "Значение числа судьбы",
                    shortDescription: "Общее описание и характеристика полученного числа судьбы:",
                    mainDescription: """
                    Ваше число Судьбы - 1 Аркан. Число 1 символизирует начало, лидерство и индивидуальность. Люди с числом судьбы 1 обладают сильной волей, стремлением к независимости и желанием быть первыми во всем. Они часто становятся пионерами в своих областях, инициируют новые проекты и не боятся брать на себя ответственность.
                    
                    Их энергия направлена на достижение целей и преодоление препятствий. Они уверены в себе, решительны и обладают природным талантом к руководству. Такие люди обычно не боятся рисковать и готовы принимать смелые решения, чтобы добиться успеха.
                    
                    Однако, стремление быть лидером может привести к изоляции, если не уделять внимание сотрудничеству и мнению других людей. Баланс между самостоятельностью и командной работой важен для гармоничного развития личности.
                    """
                ),
                Subcategory(
                    title: "Влияние на личность",
                    shortDescription: "Как число судьбы формирует ваши черты характера и поведение:",
                    mainDescription: """
                    Люди с числом судьбы 1 часто проявляют такие качества, как уверенность, решительность и целеустремленность. Они склонны к самостоятельности и предпочитают действовать независимо. Их природный оптимизм и вера в себя помогают им преодолевать трудности.
                    
                    Они могут быть новаторами и генераторами идей, вдохновляющими окружающих. Однако их стремление к лидерству может перерасти в упрямство или эгоизм, если они не научатся прислушиваться к другим.
                    
                    Для них важно развивать эмпатию и умение работать в команде, чтобы избежать конфликтов и достичь большего успеха.
                    """
                ),
                Subcategory(
                    title: "Рекомендации",
                    shortDescription: "Советы по гармонизации жизни в соответствии с вашим числом судьбы:",
                    mainDescription: """
                    - Развивайте навыки слушания: Учитесь учитывать мнение окружающих.
                    - Практикуйте терпение: Дайте другим время адаптироваться к вашим идеям.
                    - Избегайте излишнего эгоизма: Помните о важности командной работы.
                    - Уделяйте внимание отношениям: Стройте доверительные связи с близкими.
                    - Заботьтесь о здоровье: Не переутомляйтесь в погоне за успехом.
                    
                    Следуя этим советам, вы сможете достичь гармонии в личной и профессиональной сферах.
                    """
                )
            ]
        ),
    ]
}
